Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/2019-03-28-ubuntu-mate-disco-beta.po
Languages: de

source: **Ubuntu MATE 19.04 is a modest upgrade over previous releases. If you want bug fixes and improved hardware support then 19.04 is for you.**
de: **Ubuntu MATE 19.04 ist ein bescheidenes Upgrade gegenüber vorherigen Releases. Wenn du Fehlerbehebungen und verbesserte Hardware-Unterstützung möchtest, dann ist 19.04 für dich.**

source: We are preparing Ubuntu MATE 19.04 (Disco Dingo) for distribution on [April 18th, 2018](https://wiki.ubuntu.com/DiscoDingo/ReleaseSchedule) With this *Beta* pre-release, you can see what we are trying out in preparation for our next (stable) version.
de: Wir bereiten Ubuntu MAZE 19.04 (Disco Dingo) für die Verteilung am [18. April 2018] vor (https://wiki.ubuntu.com/DiscoDingo/ReleaseSchedule). Mit diesem *Beta* Pre-Release kannst du ansehen, was wir gerade ausprobieren in Vorbereitung für unsere nächste (stabile) Version.

source: {:.center} ![Ubuntu MATE 19.04 Beta](/images/blog/1904-beta.png) **Ubuntu MATE 19.04 with the Mutiny layout**
de: {:.center} ![Ubuntu MATE 19.04 Beta](/images/blog/1904-beta.png) **Ubuntu MATE 19.04 mit dem Mutiny Layout**

source: ## What works?
de: ## Was funktioniert?

source: People tell us that Ubuntu MATE is stable. You may, or may not, agree.
de: Leute sagen uns, dass Ubuntu MATE stabil ist. Du kannst damit einverstanden sein oder nicht.

source: Ubuntu MATE *Beta Releases* are *NOT* recommended for:
de: Ubuntu MATE *Beta Releases* sind *NICHT* empfohlen für:

source: * Regular users who are not aware of pre-release issues * Anyone who needs a stable system * Anyone uncomfortable running a possibly frequently broken system * Anyone in a production environment with data or workflows that need to be reliable
de: * Reguläre Benutzer, welche sich Fehlern von Pre-Releases nicht bewusst sind * Jeder, der ein stabiles System benötigt * Jeder, der sich nicht wohl ist beim Betrieb eines möglicherweise teilweise nicht intaktem System * Jeder in einer Produktionsumgebung mit Daten oder Workflows, die verlässlich sein müssen

source: Ubuntu MATE *Beta Releases* are recommended for:
de: Ubuntu MATE *Beta Releases* sind empfohlen für:

source: * Regular users who want to help us test by finding, reporting, and/or fixing bugs * Ubuntu MATE, MATE, and GTK+ developers
de: * Reguläre Benutzer, die uns mit dem Finden, Melden und/oder Beheben von Bugs helfen wollen * Ubuntu MATE, MATE, und GTK+ Entwickler

source: ## What changed since the Ubuntu MATE 18.10 final release?
de: ## Was änderte sich seit dem finalen Release von Ubuntu MATE 18.10?

source: Those of you who follow the desktop Linux news will know that upstream [MATE Desktop recently released version 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).
de: Die unter euch, die den Linux Desktop-News folgen, werden das wissen upstream [MATE Desktop recently released version 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).

source: Let's rip that band-aid off and get this over quickly. Ubuntu MATE 19.04 is shipping with MATE Desktop 1.20. Albeit, the latest maintenance release of MATE Desktop 1.20 with some of the bug fixes and new features from MATE Desktop 1.22 included. In fact, the version of MATE Desktop being shipped in 19.04 is derived from the same MATE packages that will feature in the upcoming [Debian 10 (Buster)](https://wiki.debian.org/DebianBuster) release.
de: Lass uns das Hilfeband abreissen und dies schnell hinter uns bringen. Ubuntu MATE 19.04 hat MATE Desktop 1.20 integriert. Allerdings ist der neueste Wartungsrelease von MATE Desktop 1.20 mit einigen der Fehlerbehebungen und neuen Features aus MATE Desktop 1.22 ausgerüstet. Fakt ist, dass die Version von MATE Desktop, welche in 19.04 mitgeliefert ist, abgeleitet ist von denselben MATE Paketen, welche neu sind im kommenden [Debian 10 (Buster)](https://wiki.debian.org/DebianBuster) Release.

source: You may be wondering why we're not shipping MATE Desktop 1.22? The answer, stability. MATE Desktop 1.22 introduces some underlying API changes in core components and while all first party MATE Desktop applications are compatible with the changes and completely stable, some third party applications are not. Some third party applications are big crashers now and we've not been able to fix them in time.
de: Du könntest dich wundern, warum wir nicht MATE Desktop 1.22 ausliefern? Die Antwort: Stabilität. MATE Desktop 1.22 führt unterlegene API-Änderungen in Basis-Komponenten ein und während alle First Party MATE Desktop Programme kompatibel sind mit den Änderungen und komplett stabil, sind einige Third Party Programme dies nicht. Einige Third Party Programme sind grosse Crashers jetzt und wir waren nicht fähig, diese innert nützlichen Zeit zu fixen.

source: So, we are playing it safe and sticking with MATE Desktop 1.20 and working with upstreams so we can land MATE Desktop 1.22 early in the Ubuntu MATE 19.10 development cycle.
de: Also gehen wir sicher und bleiben bei MATE Desktop 1.20 und arbeiten mit Hochdruck, damit wir MATE Desktop 1.22 früh im Ubuntu MATE 19.10 Entwicklungszyklus einfügen können.

source: [MATE Dock Applet](https://github.com/robint99/mate-dock-applet) has been updated to 0.88 which introduces some new visual options, both based on the look of the Unity desktop. As can be seen in the screenshot above these can be used to make the Mutiny layout more closely mimic Unity 7.
de: [MATE Dock Applet](https://github.com/robint99/mate-dock-applet) wurde zu 0.88, welche ein Paar neue visuelle Optionen, welche beide auf dem Look des Unity Desktops basieren, aktualisiert. Wie man im Screenshot oben sehen kann, können diese genutzt werden, um das Mutiny Layout näher am Unity 7 zu bringen.

source: Our MATE Desktop 1.20 packages ship with patches to support [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA makes MATE Desktop more aware of its execution context so that it behaves differently when run inside a remote desktop session compared to when running on local hardware. Different remote technology solutions support different features and they can now be queried from within MATE components. The inclusion of RDA offers the option to suspend your remote connection, supports folder sharing in Caja, MIME type bindings for SSHFS shares and allows session suspension via the MATE screensaver.
de: Unsere MATE Desktop 1.20 Pakete werden mit Patches zur Unterstützung von [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda) ausgeliefert. RDA macht MATE Desktop sich seines Ausführungskontextes bewusster, damit es sich unterschiedlich verhält, wenn es innerhalb einer Remotedesktop-Sitzung verglichen mit einem lokaler Hardware gestartet wird. Unterschiedliche Remote-Technologie- Lösungen unterstützen verschiedene Features und diese können nun innerhalb von MATE- Komponenten abgefragt werden. Die Beinhaltung von RDA eröffnet die Option, deine Remoteverbindung zu unterbrechen, unterstützt das Teilen von Ordner in Caja, MIME Typ- Bindungen für SSHFS-Shares und ermöglicht Sitzungsunterbrechung via dem MATE Bildschirmschoner.

source: ## Known Issues
de: ## Bekannte Fehler

source: Here are the known issues.
de: Hier sind die bekannten Fehler.

source: * The Software Boutique doesn't list any available software. * An update, due very soon, will re-stock the software library and add a few new applications too.
de: * Die Software-Boutique listet keine erhältliche Software auf. * Ein Update, sehr bald fällig, wird die Softwarebibliothek neu bestücken und auch wenige neue Programme hinzufügen.

source: ### Ubuntu family issues
de: ### Ubuntu generelle Fehler

source: This is our known list of bugs that affects all flavours.
de: Das ist unsere bekannte Liste der Fehler, die alle Varianten betreffen.

source: * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
de: * [Ubiquity Slideshows fehlen bei OEM Installationen von Ubuntu MATE und Ubuntu Budgie](https://pad.lv/1713720) * Um dies provisorisch zu beheben, starte `apt install oem-config-slideshow-ubuntu-mate` in der OEM Vorbereitungssitzung.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
de: Du wirst auch den Ubuntu MATE Bug-Tracker kontrollieren möchten, um zu sehen, was bereits gemeldet wurde. Diese Fehler werden zu gegebener Zeit behandelt werden.

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
de: Ist da irgendwas, womit du helfen kannst, oder willst du involviert sein? Vielleicht möchtest du nur deine Erfahrungen austauschen oder den Erhaltern Fragen stellen. Bitte [komm und sprich mit uns](https://ubuntu-mate.community/).
