Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/2019-03-29-ubuntu-mate-bionic-raspberry-pi.po
Languages: de, kn

source: title: Ubuntu MATE 18.04 Beta 1 for Raspberry Pi
kn: title: ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ಗಾಗಿ ಉಬುಂಟು ಮಾಟೆ 18.04 ಬೀಟಾ 1

source: We are preparing **Ubuntu MATE 18.04 (Bionic Beaver) for the Raspberry Pi**. With this *Beta* pre-release, you can see what we are trying out in preparation for our next (stable) version.
de: Wir bereiten **Ubuntu MATE 18.04 (Bionic Beaver) für das Raspberry Pi** vor. Mit diesem *Beta* Pre-Release kannst du sehen, was wir gerade ausprobieren in Vorbereitung für unsere nächste (stabile) Version.
kn: ನಾವು ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ಗಾಗಿ **ಉಬುಂಟು ಮಾಟೆ 18.04 (ಬಯೋನಿಕ್ ಬೀವರ್) ಅನ್ನು ಸಿದ್ಧಪಡಿಸುತ್ತಿದ್ದೇವೆ **. ಈ *ಬೀಟಾ* ಪೂರ್ವ-ಬಿಡುಗಡೆಯೊಂದಿಗೆ, ನಮ್ಮ ಮುಂದಿನ (ಸ್ಥಿರ) ಆವೃತ್ತಿಯ ತಯಾರಿಗಾಗಿ ನಾವು ಏನು ಪ್ರಯತ್ನಿಸುತ್ತಿದ್ದೇವೆ ಎಂಬುದನ್ನು ನೀವು ನೋಡಬಹುದು.

source: {:.center} ![Ubuntu MATE running on the Raspberry Pi 3+](/images/blog/Screenshots/09_raspberrypi.png)
de: {:.center} ![Ubuntu MATE laufend auf dem Raspberry Pi 3+](/images/blog/Screenshots/09_raspberrypi.png)
kn: {:.center} ![ರಾಸ್ಪ್ ಬೆರಿ ಪೈ 3+ ನಲ್ಲಿ ಚಾಲ್ತಿಯಲ್ಲಿರುವ ಉಬುಂಟು ಮಾಟೆ](/images/blog/Screenshots/09_raspberrypi.png)

source: Ubuntu MATE 18.04 Beta 1 is available for Raspberry Pi Model B 2, 3 and 3+, with separate images for `armhf` (ARMv7 32-bit) and `arm64` (ARMv8 64-bit). We have done what we can to optimise the builds for the Raspberry Pi without sacrificing the full desktop environment Ubuntu MATE provides on PC. High-level features of these images are:
de: Ubuntu MATE 18.04 Beta 1 ist erhältlich für Raspberry Pi Model B 2, 3 und 3+ mit separaten Images für `armhf` (ARMv7 32-bit) und `arm64` (ARMv8 64-bit). Wir haben getan was wir konnten, um die Builds für das Raspberry Pi zu optimieren, ohne der vollen Desktop-Athmosphäre, die Ubuntu MATE auf dem PC bietet, zuzusetzen. Hochkantige Features dieser Images sind:
kn: `armhf` (ARMv7 32-bit) ಮತ್ತು `arm64` (ARMv8 64-bit) ಗಳಿಗಾಗಿ ಪ್ರತ್ಯೇಕ ಇಮೇಜುಗಳನ್ನು ಒಳಗೊಂಡಂತೆ, ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ಮಾಡೆಲ್ B 2, 3 ಮತ್ತು 3+ ಗಳಿಗೆ ಉಬುಂಟು ಮಾಟೆ 18.04 ಬೀಟಾ 1 ಲಭ್ಯವಿದೆ. PCಯಲ್ಲಿ ಉಬುಂಟು ಮಾಟೆ ಒದಗಿಸುವ ಪೂರ್ಣ ಡೆಸ್ಕ್‌ಟಾಪ್ ಪರಿಸರವನ್ನು ತ್ಯಜಿಸದೆಯೇ, ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ನ ನಿರ್ಮಿತಿಗಳನ್ನು ಎಷ್ಟರ ಮಟ್ಟಿಗೆ ಅತ್ಯುತ್ತಮವಾಗಿಸಲು ಸಾಧ್ಯವೋ ಅಷ್ಟು ನಾವು ಮಾಡಿದ್ದೇವೆ. ಈ ಪ್ರತಿಗಳ ಉನ್ನತ-ಮಟ್ಟದ ವೈಶಿಷ್ಟ್ಯಗಳು:

source: * Ubuntu kernel, fully maintained by the Ubuntu Kernel and Security teams. * Automatic online filesystem expansion. * Ethernet & WiFi (*where available*) * Bluetooth (*where available*) * Audio out via 3.5mm analog audio jack or HDMI * Video out via Composite or HDMI * GPIO access via [GPIO Zero](https://gpiozero.readthedocs.io), [pigpio](http://abyz.me.uk/rpi/pigpio/) and [WiringPi](http://wiringpi.com/). * Support for [Python Wheels for the Raspberry Pi](https://www.piwheels.org/). * Support for [USB Booting](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md). * Hardware acceleration: * `fbturbo` driver is pre-installed but limited to 2D accelerated window moving/scrolling on Raspberry Pi (using the BCM2835 DMA Controller). * VLC has hardware assisted video decoding. * `ffmpeg` has hardware assisted video decoding and encoding. * The *experimental* VC4 driver can be enabled via `raspi-config`. * Please note, the `arm64` images do not feature any VideoCore IV hardware acceleration. * Additional software: * A port of [`raspi-config` for Ubuntu](https://github.com/flexiondotorg/raspi-config/) is pre-installed. * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) is available for install. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) is available for install.
de: * Ubuntu kernel, voll gewartet von dem Ubuntu Kernel und Security Teams. * Automatische online Dateiexpansion. * Ethernet & WiFi (*wo verfügbar*) * Bluetooth (*wo verfügbar*) * Audio out via 3.5mm analogem Audio Jack oder HDMI * Video out via Composite oder HDMI * GPIO Zugriff via [GPIO Zero](https://gpiozero.readthedocs.io), [pigpio](http://abyz.me.uk/rpi/pigpio/) und [WiringPi](http://wiringpi.com/). * Unterstützung für [Python Wheels für das Raspberry Pi](https://www.piwheels.org/). * Unterstützung für [USB-Start](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md). * Hardwarebeschleunigung: * `fbturbo` Treiber ist vorinstalliert aber limitiert zu 2D beschleunigten Fenstern bewegend/scrollend auf Raspberry Pi (Benutzung des BCM2835 DMA Controllers). * VLC hat Hardware unterstütztes Video-Decoding. * `ffmpeg` hat Hardware unterstütztes Video-Decoding und -Encoding. * Der *experimentelle* VC4 Treiber kann via `raspi-config` eingeschaltet werden. * Bitte beachte: die `arm64` Images beinhalten keine VideoCore IV Hardwarebeschleunigung. * Zusätzliche Software: * Ein Port von [`raspi-config` für Ubuntu](https://github.com/flexiondotorg/raspi-config/) ist vorinstalliert. * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) ist erhältlich zur Installation. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) ist erhältlich zur Installation.
kn: * ಉಬುಂಟು ಕರ್ನಲ್ ಮತ್ತು ಭದ್ರತಾ ತಂಡಗಳು ಸಂಪೂರ್ಣವಾಗಿ ನಿರ್ವಹಿಸುತ್ತಿರುವ ಉಬುಂಟು ಕರ್ನಲ್. * ಸ್ವಯಂಚಾಲಿತ ಆನ್‌ಲೈನ್ ಫೈಲ್‌ಸಿಸ್ಟಮ್ ವಿಸ್ತರಣೆ. * ಎತರ್ನೆಟ್ ಮತ್ತು WiFi (*ಲಭ್ಯವಿರುವಲ್ಲಿ*) * ಬ್ಲೂಟೂತ್ (*ಲಭ್ಯವಿರುವಲ್ಲಿ*) * 3.5ಮಿಮೀ ಅನಲಾಗ್ ಆಡಿಯೊ ಜ್ಯಾಕ್ ಅಥವಾ ಎಚ್‌ಡಿಎಂಐ ಮೂಲಕ ಆಡಿಯೋ ಔಟ್ * ಕಾಂಪೋಸಿಟ್ ಅಥವಾ ಎಚ್‌ಡಿಎಂಐ ಮೂಲಕ ವೀಡಿಯೊ ಔಟ್ * [GPIO Zero](https://gpiozero.readthedocs.io), [pigpio](http://abyz.me.uk/rpi/pigpio/) ಮತ್ತು [WiringPi](http://wiringpi.com/) ಗಳ ಮೂಲಕ GPIO ಪ್ರವೇಶ. * [ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ಗಾಗಿ ಪೈಥಾನ್ ವೀಲ್ಸ್](https://www.piwheels.org/) ಗೆ ಬೆಂಬಲ. * [USB ಬೂಟಿಂಗ್](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md) ಗೆ ಬೆಂಬಲ. * ಯಂತ್ರಾಂಶ ವೇಗವರ್ಧನೆ: * `fbturbo` ಡ್ರೈವರ್ ಅನ್ನು ಮೊದಲೇ ಸ್ಥಾಪಿಸಲಾಗಿದೆ ಆದರೆ ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ನಲ್ಲಿ 2D ವೇಗವರ್ಧಿತ ವಿಂಡೋ ಮೂವಿಂಗ್ / ಸ್ಕ್ರೋಲಿಂಗ್‌ಗೆ ಸೀಮಿತವಾಗಿದೆ (BCM2835 DMA ನಿಯಂತ್ರಕವನ್ನು ಬಳಸಿಕೊಂಡು). * VLC ಯು ಯಂತ್ರಾಂಶ ನೆರವಿನ ವೀಡಿಯೊ ಡಿಕೋಡಿಂಗ್ ಹೊಂದಿದೆ. * `ffmpeg` ಯಂತ್ರಾಂಶ ನೆರವಿನ ವೀಡಿಯೊ ಡಿಕೋಡಿಂಗ್ ಮತ್ತು ಎನ್ಕೋಡಿಂಗ್ ಹೊಂದಿದೆ. * `raspi-config` ಮೂಲಕ *ಪ್ರಾಯೋಗಿಕ * VC4 ಚಾಲಕವನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಬಹುದು. * ದಯವಿಟ್ಟು ಗಮನಿಸಿ, `arm64` ಪ್ರತಿಗಳು ಯಾವುದೇ VideoCore IV ಯಂತ್ರಾಂಶ ವೇಗವರ್ಧನೆಯನ್ನು ಒಳಗೊಂಡಿರುವುದಿಲ್ಲ. * ಹೆಚ್ಚುವರಿ ತಂತ್ರಾಂಶ: * [ಉಬುಂಟುಗಾಗಿ `raspi-config`](https://github.com/flexiondotorg/raspi-config/) ನ ಪೋರ್ಟ್ ಪೂರ್ವ-ಸ್ಥಾಪಿತವಾಗಿದೆ. * [Steam ಕೊಂಡಿ](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) ಅನುಸ್ಥಾಪಿಸಲು ಉಪಲಭ್ದವಿದೆ. * [Minecraft: Pi ಆವೃತ್ತಿ](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) ಅನುಸ್ಥಾಪಿಸಲು ಉಪಲಭ್ದವಿದೆ.

source: ## Supported Raspberry Pi
de: ## Unterstützte Raspberry Pi
kn: ## ಬೆಂಬಲಿತ ರಾಸ್ಪ್ ಬೆರಿ ಪೈ

source: * These images will work on: * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(recommended)**
de: * Diese Images werden funktionieren auf: * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(empfohlen)**
kn: * ಈ ಪ್ರತಿಗಳು ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಕೆಲಸಮಾಡುತ್ತವೆ: * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ)**

source: * These images *kind of* work on: * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(not recommended)** * Fails to complete the first boot setup due to insufficient memory. * If you have completed the setup on another Pi that card can be inserted in a Pi 3 Model A+ and it will work. * Due to only having 512MB RAM the `arm64` is not recommended. The `armhf` version can be very tight on resources.
de: * Diese Images funktionieren *ungefähr* auf: * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(nicht empfohlen)** * Schlägt fehl beim Abschliessen des ersten Boot Setup wegen unzureichendes Speichers. * Wenn du den Setup auf anderen Pi abgeschlossen hast, kann diese Karte in ein Pi 3 Model A+ eingeschoben werden und es wird funktionieren. * Weil es nur 512MB RAM hat ist `arm64` nicht empfohlen. Die `armhf` Version kann sehr streng mit Ressourcen sein.
kn: * ಈ ಪ್ರತಿಗಳು ಇದರಲ್ಲಿ 'ಬಹುತೇಕ' ಕೆಲಸಮಾಡುತ್ತವೆ: * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(ಶಿಫಾರಸು ಮಾಡುವುದಿಲ್ಲ)** * ಸಾಕಷ್ಟು ಮೆಮೊರಿ ಇಲ್ಲದ ಕಾರಣ ಮೊದಲ ಬೂಟ್ ಸೆಟಪ್ ಪೂರ್ಣಗೊಳಿಸಲು ವಿಫಲಗೊಳ್ಳುತ್ತದೆ. * ನೀವು ಇನ್ನೊಂದು Pi ನಲ್ಲಿ ಸೆಟಪ್ ಅನ್ನು ಪೂರ್ಣಗೊಳಿಸಿದ್ದರೆ ಆ ಕಾರ್ಡ್ ಅನ್ನು Pi 3 Model A+ ನಲ್ಲಿ ಸೇರಿಸಬಹುದು ಮತ್ತು ಅದು ಕೆಲಸ ಮಾಡುತ್ತದೆ. * ಕೇವಲ 512MB RAM ಹೊಂದಿರುವ ಕಾರಣ `arm64` ಅನ್ನು ಶಿಫಾರಸು ಮಾಡುವುದಿಲ್ಲ. `arm64` ಆವೃತ್ತಿಯು ಸಂಪನ್ಮೂಲಗಳ ಮೇಲೆ ತುಂಬಾ ಬಿಗಿಯಾಗಿರುತ್ತದೆ.

source: ## Unsupported Raspberry Pi
de: ## Nicht untestützte Raspberry Pi
kn: ## ಬೆಂಬಲವಿಲ್ಲದ ರಾಸ್ಪ್ ಬೆರಿ ಪೈ

source: * These images **will not work on** any Raspberry Pi model using an ARMv6 instruction set: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)
de: * Diese Images **werden nicht funktionieren auf** irgendeinem Raspberry Pi Modell, welches ein ARMv6 Instruktionsset nutzt: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)
kn: * ARMv6 ಸೂಚನಾ ಸೆಟ್ ಬಳಸುವ ಯಾವುದೇ ರಾಸ್ಪ್ ಬೆರಿ ಪೈ ಮಾದರಿಯಲ್ಲಿ ಈ ಪ್ರತಿಗಳು **ಕೆಲಸ ಮಾಡುವುದಿಲ್ಲ**: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)

source: ## Recent Changes
de: ## Neuliche Änderungen
kn: ## ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು

source: ### Ubuntu MATE 18.04.2 Beta 1 - March 24th, 2019
de: ### Ubuntu MATE 18.04.2 Beta 1 - 24. März 2019
kn: ### ಉಬುಂಟು ಮಾಟೆ 18.04.2 ಬೀಟಾ 1 - ಮಾರ್ಚ್ 24, 2019

source: * Fixed EGL/GLES/OpenVG libraries for VideoCore IV. * Fixed Raspberry Pi features in Ubuntu MATE Welcome. * Added hardware accelerated VLC (`armhf` only). * Added hardware accelerated ffmpeg (`armhf` only). * Enabled piwheels. * Reduced boot time, after the initial first boot setup has been completed, by ~3 seconds. * Uploaded SteamLink (`armhf` only) to the archive, not pre-installed. * Uploaded Minecraft Pi Edition (`armhf` only) to the archive, not pre-installed. * Raspberry Pi 3 Model A+ confirmed working, *kind of*.
de: * Gefixte EGL/GLES/OpenVG Bibliotheken für VideoCore IV. * Gefixte Raspberry Pi Features in Ubuntu MATE Welcome. * Hardwarebeschleunigtes VLC (nur `armhf`) hinzugefügt. * Hardwarebeschleunigtes ffmpeg (nur `armhf`) hinzugefügt. * Piwheels aktiviert. * Startzeit, nachdem der Initial-Setup abgeschlossen ist, um ~3 Sekunden reduziert. * SteamLink (nur `armhf`) ins Archiv hochgeladen, nicht vorinstalliert. * Minecraft Pi Edition (nur `armhf`) ins Archiv hochgeladen, nicht vorinstalliert. * Raspberry Pi 3 Model A+ bestätigt, dass es *ungefähr* funktioniert.
kn: * ವಿಡಿಯೋಕೋರ್ IV ಗಾಗಿ EGL/GLES/OpenVG ಗ್ರಂಥಾಲಯಗಳು ಸರಿಪಡಿಸಲಾಗಿದೆ. * ಉಬುಂಟು ಮಾಟೆ Welcomeನಲ್ಲಿ Raspberry Pi ನ ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ಸರಿಪಡಿಸಲಾಗಿದೆ. * ಹಾರ್ಡ್‌ವೇರ್ ವೇಗವರ್ಧಿತ VLC ಸೇರಿಸಲಾಗಿದೆ (`armhf` ಮಾತ್ರ). * ಹಾರ್ಡ್‌ವೇರ್ ವೇಗವರ್ಧಿತ ffmpeg ಸೇರಿಸಲಾಗಿದೆ (`armhf` ಮಾತ್ರ). * piwheels ಅನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ. * ಆರಂಭಿಕ ಮೊದಲ ಬೂಟ್ ಸೆಟಪ್ ಪೂರ್ಣಗೊಂಡ ನಂತರ ~3 ಸೆಕೆಂಡುಗಳಷ್ಟು ಕಡಿಮೆಯಾದ ಬೂಟ್ ಸಮಯ. * ಆರ್ಕೈವ್‌ಗೆ SteamLink (`armhf` ಮಾತ್ರ) ಅಪ್‌ಲೋಡ್ ಮಾಡಲಾಗಿದೆ, ಪೂರ್ವ-ಸ್ಥಾಪಿತವಲ್ಲ. * ಆರ್ಕೈವ್‌ಗೆ Minecraft Pi ಆವೃತ್ತಿ (`armhf` ಮಾತ್ರ) ಅಪ್‌ಲೋಡ್ ಮಾಡಲಾಗಿದೆ, ಪೂರ್ವ-ಸ್ಥಾಪಿತವಲ್ಲ. * Raspberry Pi 3 Model A+ ಕೆಲಸ ಮಾಡುವುದನ್ನು ದೃಢಪಡಿಸಲಾಗಿದೆ, *ಬಹುತೇಕ*.

source: ### Ubuntu MATE 18.04.2 - March 5th, 2019
de: ### Ubuntu MATE 18.04.2 - 5. März 2019
kn: ### ಉಬುಂಟು ಮಾಟೆ 18.04.2 - ಮಾರ್ಚ್ 5, 2019

source: * Fixed HDMI audio quality. * Fixed USB booting. * Fixed font caches. * Added pre-seeded snaps. * Added miscellaneous Raspberry Pi utilities. * Added EGL/GLES/OpenVG libraries for VideoCore IV. * Enabled splash screen. * Improved window manager responsiveness. * Reduced idle RAM consumption by ~30MB on arm64 and ~10MB on armhf. * Switched to the CFQ scheduler.
de: * Gefixte HDMI Audioqualität. * Gefixter USB-Start. * Gefixte Schrift-Caches. * Vorausgewählte Schnappschüsse hinzugefügt. * Diverse Raspberry Pi Utilities hinzugefügt. * EGL/GLES/OpenVG Bibliotheken für VideoCore IV hinzugefügt. * Splash Screen aktiviert. * Verbesserte Fenstermanager-Reaktionen. * Leerlauf RAM-Verbrauch um ~30MB bei arm64 und ~10MB bei armhf reduziert. * Zum CFQ Scheduler gewechselt.
kn: * HDMI ಆಡಿಯೊ ಗುಣಮಟ್ಟ ಸರಿಪಡಿಸಲಾಗಿದೆ. * USB ಬೂಟಿಂಗ್ ಸರಿಪಡಿಸಲಾಗಿದೆ. * ಅಕ್ಷರ ಸಂಗ್ರಹಗಳನ್ನು ಸರಿಪಡಿಸಲಾಗಿದೆ. * ಪೂರ್ವ-ಬಿತ್ತಿದ snapಗಳನ್ನು ಸೇರಿಸಲಾಗಿದೆ. * ವಿವಿಧ Raspberry Pi ಉಪಯುಕ್ತತೆಗಳನ್ನು ಸೇರಿಸಲಾಗಿದೆ. * VideoCore IV ಗಾಗಿ EGL/GLES/OpenVG ಗ್ರಂಥಾಲಯಗಳನ್ನು ಸೇರಿಸಲಾಗಿದೆ. * splash ಪರದೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ. * ವಿಂಡೋ ಮ್ಯಾನೇಜರ್ ಪ್ರತಿಕ್ರಿಯಾತ್ಮಕತೆಯನ್ನು ಸುಧಾರಿಸಲಾಗಿದೆ.. * ಜಡ RAM ಬಳಕೆಯನ್ನು arm64ನಲ್ಲಿ ~30MB ಅಷ್ಟು ಮತ್ತು armhfನಲ್ಲಿ ~10MB ಅಷ್ಟು ಕಡಿಮೆ ಮಾಡಲಾಗಿದೆ. * CFQ ಶೆಡ್ಯೂಲರ್‌ಗೆ ಬದಲಾಯಿಸಲಾಗಿದೆ.

source: ### Ubuntu MATE 18.04.2 Alpha 1 - March 2nd, 2019
de: ### Ubuntu MATE 18.04.2 Alpha 1 - 2. März 2019
kn: ### ಉಬುಂಟು ಮಾಟೆ 18.04.2 ಆಲ್ಫಾ 1 - ಮಾರ್ಚ್ 2, 2019

source: * Initial Ubuntu MATE 18.04.2 images made available for private testing.
de: * Erste Ubuntu MATE 18.04.2 Images für privates Testen verfügbar gemacht.
kn: * ಆರಂಭಿಕ ಉಬುಂಟು ಮಾಟೆ 18.04.2 ಇಮೇಜುಗಳನ್ನು ಖಾಸಗಿ ಪರೀಕ್ಷೆಗೆ ಲಭ್ಯಗೊಳಿಸಲಾಗಿದೆ.

source: ## Feedback and Improvements
de: ## Feedback und Verbesserungen
kn: ## ಪ್ರತಿಕ್ರಿಯೆ ಮತ್ತು ಸುಧಾರಣೆಗಳು

source: Thse images are not official Ubuntu products and are community supported by the Ubuntu MATE team. Please post feedback and issues on the [dedicated community forum](https://ubuntu-mate.community/c/support/raspberry-pi-2).
de: Diese Images sind nicht offizielle Ubuntu-Produkte und sind Community unterstützt vom Ubuntu MATE Team. Bitte poste Feedback und Fehler im [eigenen Community-Forum](https://ubuntu-mate.community/c/support/raspberry-pi-2).
kn: ಈ ಪ್ರತಿಗಳು ಅಧಿಕೃತ ಉಬುಂಟು ಉತ್ಪನ್ನಗಳಲ್ಲ ಮತ್ತು ಉಬುಂಟು ಮಾಟೆ ತಂಡದಿಂದ ಸಮುದಾಯ ಬೆಂಬಲಿತವಾಗಿವೆ. ದಯವಿಟ್ಟು ಪ್ರತಿಕ್ರಿಯೆಗಳನ್ನು ಹಾಗು ಸಮಸ್ಯೆಗಳನ್ನು [ಮೀಸಲಾದ ಸಮುದಾಯ ವೇದಿಕೆಯಲ್ಲಿ](https://ubuntu-mate.community/c/support/raspberry-pi-2) ಪೋಸ್ಟ್ ಮಾಡಿ.
