Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/about.po
Languages: ru

source: title: About
ru: title: О проекте

source: # Objectives
ru: # Цели

source: Ubuntu MATE has a number of guiding objectives and goals.
ru: Ubuntu MATE имеет ряд главных целей и задач.

source: * Accessible to all, regardless of language and physical ability. * Increase both Ubuntu and MATE Desktop user adoption. * Ubuntu alternative for computers that aren’t powerful enough to run a composited desktop. * First choice Ubuntu platform for remote workstation solutions such as LTSP and X2Go. * Recreate the halcyon days of Ubuntu for users who prefer a traditional desktop metaphor. * Use themes and artwork similar to Ubuntu so that Ubuntu MATE is immediately familiar. * When possible contribute to Debian so both the Debian and Ubuntu communities benefit. * Software selection will favour functionality and stability over lightness and whimsy.
ru: * Доступность для всех, независимо от языка и физических возможностей. * Увеличение числа пользователей Ubuntu и MATE Desktop. * Альтернатива Ubuntu для компьютеров, недостаточно мощных для работы с композитным рабочим столом. * Платформа Ubuntu первого выбора для решений удаленного рабочего стола, таких как LTSP и X2Go. * Воссоздание безмятежных дней Ubuntu для пользователей, предпочитающих традиционную метафору рабочего стола. * Использование тем и изображений, похожие на Ubuntu, чтобы Ubuntu MATE стал вам сразу знаком. * По возможности внесение вклада в Debian, чтобы выиграли оба сообщества - Debian и Ubuntu. * При выборе программного обеспечения предпочтение будет отдано функциональности и стабильности, а не легкости и прихоти.

source: # What _really_ is Ubuntu MATE?
ru: # Что _на самом деле_ такое Ubuntu MATE?

source: If you are new to Ubuntu MATE, or only casually acquainted with Linux based distributions, it can be difficult to understand how a Linux operating system compares with other computer systems that you may already be familiar with. Hopefully this page will help demystify Ubuntu MATE for new-comers.
ru: Если вы новичок в Ubuntu MATE или только случайно знакомы с дистрибутивами на основе Linux, то вам может быть сложно понять, как операционная система Linux сравнивается с другими компьютерными системами, с которыми вы, возможно, уже знакомы. Надемся, эта страница поможет демистифицировать Ubuntu MATE для новичков.

source: [Ubuntu] is one of, if not the, largest deployed [Linux] based desktop operating systems in the world. [Linux] is at the heart of Ubuntu and makes it possible to create secure, powerful and versatile operating systems, such as Ubuntu and Android. [Android] is now in the hands of billions of people around the world and it’s also powered by Linux.
ru: [Ubuntu] является одной из, если не самой распространенной, операционной системой на основе ядра [Linux] для персональных компьютеров в мире. Ядро [Linux] лежит в основе Ubuntu и позволяет создавать безопасные, мощные и универсальные операционные системы, такие как Ubuntu и Android. [Android] сейчас находится в руках миллиардов людей по всему миру, и он также работает на основе Linux.

source: Ubuntu is available in a number of different flavours, each coming with its own desktop environment. Ubuntu MATE takes the Ubuntu base operating system and adds the MATE Desktop.
ru: Ubuntu доступна в виде различных редакций, каждая из которых поставляется со своим окружением рабочего стола. Ubuntu MATE использует базовые компоненты Ubuntu с добавлением рабочего стола MATE Desktop.

source: {:.center} ![Ubuntu flavours](/images/history/join-family.svg)
ru: {:.center} ![Редакции Ubuntu](/images/history/join-family.svg)

source: ## MATE Desktop
ru: ## Рабочий стол MATE Desktop

source: Wikipedia defines a [Desktop Environment] as:
ru: Wikipedia определяет [Среду рабочего стола] как:

source: > an implementation of the desktop metaphor made of a bundle of programs running on top of a computer operating system, which share a common graphical user interface (GUI). Desktop GUIs help the user to easily access and edit files.
ru: > реализация метафоры рабочего стола, состоящая из связки программ, работающих в операционной системе компьютера, которые имеют общий графический пользовательский интерфейс (GUI). Графический интерфейс рабочего стола помогает пользователю легко открывать и редактировать файлы.

source: The [MATE Desktop] is one such implementation of a desktop environment and includes a file manager which can connect you to your local and networked files, a text editor, calculator, archive manager, image viewer, document viewer, system monitor and terminal. All of which are highly customisable and managed via a control centre.
ru: Среда рабочего стола [MATE Desktop] включает менеджер файлов, который позволяет работать с вашими локальными или сетевыми файлами, текстовый редактор, калькулятор, менеджер архивов, программу просмотра изображений, просмотрщик документов, системный монитор и терминал. Все программы могут быть тщательно настроены через Центр управления.

source: [MATE Desktop] provides an intuitive and attractive desktop environment using traditional metaphors, which means if you’ve ever used [Microsoft Windows] or [Apple's macOS], it will feel very familiar.
ru: [MATE Desktop] предоставляет интуитивный и привлекательный рабочий стол с использованием традиционных метафор, хорошо знакомых пользователям [Microsoft Windows] или [Apple's macOS].

source: The MATE Desktop has a rich history and is the continuation of the GNOME 2 desktop, which was the default desktop environment on many Linux and Unix operating systems for over a decade. This means that MATE Desktop is tried, tested and very reliable.
ru: Рабочий стол MATE Desktop имеет длительную историю и является развитием и продолжением среды GNOME 2, которая использовалась многими операционными системами мира Linux и Unix более десятилетия. Таким образом MATE Desktop является апробированным, протестированным и надежным.

source: ## First Class for Gaming
ru: ## Высоклассный уровень игр

source: {:.center} ![Steam screenshot](/images/homepage/05_netbook.png)
ru: {:.center} ![окно Steam](/images/homepage/05_netbook.png)

source: In recent years Linux has become a first class gaming platform thanks to [Valve] bringing the [Steam] platform to Linux. At the time of writing Steam has thousands of high quality indie and AAA titles available for Linux. Ubuntu MATE is fully compatible with Steam for Linux.
ru: В последние годы Linux превратился в высококлассную игровую платформу благодаря [Valve], принесшей платформу [Steam] в мир Linux. В настоящее время в Steam имеются тысячи высококлассных инди и AAA игр, доступных для Linux. Ubuntu MATE полностью совместим со Steam для Linux.

source: While [Steam] is a major step forward for gaming on Linux, there are also many high quality and enjoyable Open Source games titles available for Ubuntu MATE via Software Boutique and Software Centre. It doesn’t matter if you like flight simulators, motor racing, first person shooters, jump and run or card games, you’ll find something to keep you entertained.
ru: В то время как [Steam] является серьезным шагом вперед для игр под Linux, также множество игр с открытым исходным кодом может быть установлено в Ubuntu MATE с помощью Магазина программного обеспечения и Центра программ. Неважно, любите ли вы авиасимуляторы, автоспорт, шутеры от первого лица, прыжки и бег или карточные игры, вы найдете что-то, что вас развлечет.

source: ## Open Source
ru: ## Открытый исходный код

source: What Linux, Ubuntu and MATE Desktop all have in common is they are Open Source. Open source software is software that can be freely used, changed, and shared (in modified or unmodified form) by anyone. In a nutshell Ubuntu MATE is free, in the truest sense of the word.
ru: Linux, Ubuntu и MATE Desktop объединяет одно - они все имеют открытый исходный код. Программное обеспечение с открытым исходным кодом может быть свободно использовано, распространено (в измененной или неизменной формах) кем угодно. Короче говоря, Ubuntu MATE бесплатен и свободен в прямом смысле этого слова.

source: Although you will find some versions (distributions) of Linux for purchase, the vast majority are provided free of charge, like Ubuntu MATE. Open Source software is licensed in a way that allows anyone to give it away for free, no strings attached. For example, the licence gives any member of the user community the freedom to use Linux for any purpose, to distribute, modify, redistribute, or even sell the operating system. If you do modify and then redistribute Linux with your modifications, you are required by the licence to submit your modifications for possible inclusion into future versions. There is no guarantee that this will ever happen, but if you have made it better, then your changes just might be included in the next release of Ubuntu MATE.
ru: Хотя вы найдете некоторые версии (дистрибутивы) Linux для покупки, подавляющее большинство из них предоставляется бесплатно, например Ubuntu MATE. Программное обеспечение с открытым исходным кодом лицензируется таким образом, чтобы каждый мог раздавать его бесплатно, без каких-либо условий. Например, лицензия дает любому члену сообщества пользователей свободу использовать Linux для любых целей, распространять, изменять или даже продавать операционную систему. Если вы модифицируете, а затем распространяете Linux с вашими модификациями, по лицензии вы должны представить свои модификации для возможного включения в будущие версии. Нет никакой гарантии, что это когда-либо произойдет, но если вы сделали это лучше, ваши изменения могут быть включены в следующий выпуск Ubuntu MATE.

source: This is how we can continually improve and grow without having to charge our users money. Many of the users of Linux are corporations that use the operating system to run their businesses, or include it within their products. Many of these corporations provide fixes and new features for Linux as they use the software for their businesses. These improvements are given back to the Linux distribution and the software improves as a result.
ru: Таким образом мы можем постоянно улучшаться и расти, не взимая с наших пользователей деньги. Многие из пользователей Linux - корпорации, которые используют операционную систему для ведения своего бизнеса или включают ее в свои продукты. Многие из этих корпораций предоставляют исправления и новые функции для Linux, поскольку они используют программное обеспечение для своего бизнеса. Эти улучшения возвращаются в дистрибутив Linux, и в результате программное обеспечение улучшается.

source: Unlike Windows, and macOS, Linux is not created and supported by just one company. It is supported by Intel, Red Hat, Linaro, Samsung, IBM, SUSE, Texas Instruments, Google, Canonical, Oracle, AMD, and Microsoft. Over 4,000 developers contributed to Linux over the last 15 years.
ru: В отличие от Windows и macOS, Linux не создается и поддерживается только одной компанией. Он поддерживается Intel, Red Hat, Linaro, Samsung, IBM, SUSE, Texas Instruments, Google, Canonical, Oracle, AMD и Microsoft. Более 4000 разработчиков внесли свой вклад в Linux за последние 15 лет.

source: Whether you are a home user of Ubuntu MATE, a Ubuntu MATE software or application developer, or an employee of an organisation that uses the operating system, you are a member of the Linux and Open Source communities and benefit from the efforts of the developers who contribute to Ubuntu MATE and its related projects, Linux, MATE, and Ubuntu. Members of the community can and do run Linux on almost any hardware, from the prettiest MacBook to the cheapest netbook, from the newest Chromebook to some very old machines designed for Windows, and from the most powerful Internet servers to the smallest smart thermostat.
ru: Являетесь ли вы домашним пользователем Ubuntu MATE, разработчиком программного обеспечения или приложений Ubuntu MATE или сотрудником организации, использующей операционную систему, вы являетесь членом сообществ Linux и Open Source и получаете выгоду от усилий разработчиков, которые внесли свой вклад в Ubuntu MATE и связанные с ним проекты, Linux, MATE и Ubuntu. Члены сообщества могут запускать Linux практически на любом оборудовании, от самого красивого MacBook до самого дешевого нетбука, от новейшего Chromebook до некоторых очень старых машин, разработанных для Windows, и от самых мощных Интернет-серверов до самого маленького интеллектуального термостата.

source: ## Powerful Applications
ru: ## Эффективные приложения

source: While MATE Desktop provides the essential user interfaces to control and use a computer, Ubuntu MATE adds a collection of additional applications to turn your computer into a truly powerful workstation.
ru: В то время как MATE Desktop предоставляет необходимые пользовательские интерфейсы для управления компьютером и его использования, Ubuntu MATE добавляет набор дополнительных приложений, которые превращают ваш компьютер в действительно мощную рабочую станцию.

source: title = "What's installed?" text = "Take a look at list of applications and features that make up this distribution." button_text = "See Features" button_url = "/features/"
ru: title = "Что предустановлено?" text = "Посмотрите на список включенных в этот дистрибутив приложений и их возможности." button_text = "Смотреть возможности" button_url = "/features/"

source: [Ubuntu]: https://www.ubuntu.com/ [Linux]: https://en.wikipedia.org/wiki/Linux [Android]: https://www.android.com/ [Desktop Environment]: https://en.wikipedia.org/wiki/Desktop_environment [MATE Desktop]: https://mate-desktop.org [Microsoft Windows]: https://www.microsoft.com/windows [Apple's macOS]: https://apple.com/mac [Valve]: http://www.valvesoftware.com/ [Steam]: https://store.steampowered.com/
ru: [Ubuntu]: https://www.ubuntu.com/ [Linux]: https://en.wikipedia.org/wiki/Linux [Android]: https://www.android.com/ [Desktop Environment]: https://en.wikipedia.org/wiki/Desktop_environment [Среду рабочего стола]: https://mate-desktop.org [Microsoft Windows]: https://www.microsoft.com/windows [Apple's macOS]: https://apple.com/mac [Valve]: http://www.valvesoftware.com/ [Steam]: https://store.steampowered.com/
