Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-verify-quick.po
Languages: ru

source: title: Verifying Downloads
ru: title: Верификация загрузок

source: ## Verify for Corruption
ru: ## Проверка целостности

source: A checksum is a string of letters and numbers that is unique to a file, like a fingerprint. Checksums are generated by different algorithms, with the two most popular being **Secure Hash Algorithms (SHAs)** and the **MD5** algorithm. Ubuntu MATE provides the **SHA256** checksum on its [download](/download/) page.
ru: Контрольная сумма представляет собой строку из букв и цифр, которые уникальные для каждого файла, как отпечатки пальцев. Контрольные суммы рассчитываются с использованием различных алгоритмов, наиболее популярными из которых являются два - **Secure Hash Algorithms (SHAs)** и **MD5**. Ubuntu MATE предоставляет контрольную суммы **SHA256** на [странице загрузок](/download/).

source: Verifying a download involves checking the checksum of the file you downloaded *versus* the checksum provided on the download web site. Mismatching checksums can indicate a corrupted or otherwise compromised file, so verifying your downloads is a good habit to adopt!
ru: Верификация загрузки выполняется путем расчета контрольной суммы загруженного файла *относительно* контрольной суммы, опубликованной на сайте, с которого вы загрузили файл. Несовпадение контрольной суммы может означать повреждение или компрометацию файла, поэтому проверка загрузок - это хорошая привычка!

source: As an alternate, you can check your downloaded is trustworthy, by [verifying the digital signature](/faq/verify-download-secure/) of the file instead.
ru: В качестве альтернативы вы можете вместо этого проверить достоверность загруженного файла, путем [проверки его цифровой подписи](/faq/verify-download-secure/).

source: This method uses a third-party application named **MD5 & SHA Checksum Utility**.
ru: Этот метод использует стороннее приложение под названием **MD5 & SHA Checksum Utility**.

source: * Download [MD5 & SHA Checksum Utility](https://raylin.wordpress.com/downloads/md5-sha-1-checksum-utility/) * Launch the application *MD5_and_SHA_Checksum_Utility.exe* * Click on the **Browse** button and browse to the *Ubuntu MATE* ISO file.
ru: * Загрузите утилиту [MD5 & SHA Checksum](https://raylin.wordpress.com/downloads/md5-sha-1-checksum-utility/) * Запустите файл утилиты *MD5_and_SHA_Checksum_Utility.exe* * Нажмите кнопку **Browse** и выберите ISO-файл *Ubuntu MATE*.

source: **Note:** To make calculation faster, it's only necessary to check the checksums you have values for.
ru: **Примечание:** для ускорения вычислений рекомендуется проверять только те контрольные суммы, для которых у вас есть эталонные значения.

source: On macOS, you can verify checksums easily and manually in the command line, as `shasum` comes preinstalled.
ru: В системе macOS, вы можете легко проверить контрольную сумму вручную в терминале поскольку программа `shasum` предустановлена.

source: * Open a **Terminal** window and a **Finder** window containing the ISO. * Type `shasum -a 256` and drag the ISO's file icon into **Terminal**.
ru: * Запустите **Терминал** и **Finder** в каталоге, содержащем ISO-файл. * В терминале напишите `shasum -a 256` и перетащите пиктограмму ISO-файла из **Finder** в окно терминала.

source: * Press **Enter** to begin the process. This may take a few moments. * Compare the SHA256 checksum printed to the command line to the checksum on the image's download page.
ru: * Нажмите **Enter** для запуска процесса. Это может потребовать некоторого времени. * Сравните контрольную сумму SHA256 из терминала с суммой, указанной на странице загрузке образа диска.

source: This application can be installed via your distribution's software manager, if it is not already installed.
ru: Если это приложение еще не установлено, то оно может быть установлено через менеджер программного обеспечения вашего дистрибутива.

source: * Launch `gtkhash` * In the **File** dropdown menu, select the ISO you wish to check * On the page where you downloaded the ISO, copy the SHA256 checksum and paste into the **Check** field * Click **Hash** - a green checkmark means the image is verified
ru: * Запустите `gtkhash`. * В выпадающем меню **Файл** выберите файл ISO для проверки. * Со страницы загрузки ISO файла скопируйте контрольную сумму SHA256 и вставьте ее в соответствующее текстовое поле в области **Сравнить**. * Нажмите кнопку **Хэш** - появившаяся в результате зеленая галочка означает успешную проверку.

source: #### Command Line
ru: #### В терминале

source: On every distribution, you have command line tools for verifying checksums. In this case, we're interested in the `sha256sum` tool.
ru: Каждый дистрибутив включает команды терминала для проверки контрольных сумм. В этом случае нам понадобится утилита `sha256sum`.

source: * First, switch to the directory where the ISO is stored * Enter `sha256sum ubuntu-mate-XX.XX-version.iso`, substituting the name of the specific ISO you downloaded. * Compare the SHA256 checksum printed to the command line to the checksum on the download page.
ru: * Сначала перейдите в каталог с загруженным ISO файлом * Введите команду `sha256sum ubuntu-mate-XX.XX-version.iso`, заменив имя файла в соответствии с именем загруженного ISO-файла. * Сравните контрольную сумму SHA256 из терминала с суммой, указанной на странице загрузке образа диска.

source: On current Ubuntu MATE versions (18.04 LTS and newer), `caja-gtkhash` is pre-installed and allows you to perform checksums from within the file browser.
ru: В актуальных версиях Ubuntu MATE (18.04 LTS и новее), предустановлено дополнение `caja-gtkhash` для выполнения операций с контрольными суммами из файлового менеджера.

source: * Navigate to the file in the Caja file manager. * Right click the file and choose **Properties**. * Open the **Digests** tab. * Copy the SHA256SUM checksum from the download page and paste into **Check** field. The green check mark means the download is verified.
ru: * В файловом менеджере Caja перейдите в каталог с файлом ISO. * Сделайте правый щелчок на файле и выберите пункт меню **Свойства**. * Перейдите на вкладку **Дайджесты**. * Со страницы загрузки ISO файла скопируйте контрольную сумму SHA256 и вставьте ее в соответствующее текстовое поле в области **Сравнить** и нажмите кнопку **Хэш**. Появившаяся в результате зеленая галочка означает успешную проверку.

source: ![Check SHA256 Hash](/images/faq/verify/Check-SHA256-Hash.png)
ru: ![Проверка суммы SHA256](/images/faq/verify/Check-SHA256-Hash.png)
