Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-roadmap.po
Languages: ru

source: title: Roadmap
ru: title: Оперативный план

source: # Outstanding Objectives
ru: # Важнейшие цели

source: This page outlines some of the activities the Ubuntu MATE team will research, and possibly implement, in future development cycles to improve and refine our operating system.
ru: На этой странице описаны некоторые виды деятельности, которые команда Ubuntu MATE будет исследовать и, возможно, реализовывать в будущих циклах разработки для улучшения и совершенствования нашей операционной системы.

source: ## Grow community participation and engagement
ru: ## Увеличение участия сообщества и его вовлеченности

source: Ubuntu MATE and MATE Desktop are created by very small teams. We’ll improve our documentation so that new contributors can find tasks they can work on and material to help them get started.
ru: Команды проектов Ubuntu MATE и MATE Desktop содержат достаточно малое количество участников. Мы будем улучшать документацию, чтобы новые участники могли находить задачи, требующие решения, и материалы, помогающие им начать работать.

source: ## Reboot Ubuntu MATE Welcome and Software Boutique
ru: ## Перезагрузка программ Ubuntu MATE Welcome и Software Boutique

source: We will decouple Ubuntu MATE Welcome and the Software Boutique so they can be iterated on independently. The code for both will be refactored and simplified so that other projects wanting to build on either can easily do so.
ru: Мы разделим Ubuntu MATE Welcome (Добро пожаловать) и Software Boutique (Магазин программного обеспечения), чтобы их можно было использовать независимо. Код для обеих программ будет реорганизован и упрощен, чтобы другие проекты, желающие использовать любой из них, могли легко это сделать.

source: Both applications will be delivered as snaps to break the development cycle relationship with the distribution, giving us the freedom to develop both without the usual constraints of distribution release management. This will also benefit Ubuntu MATE, which will automatically get new features, application listings, and other improvements.
ru: Оба приложения будут поставлять как snaps чтобы разорвать связь цикла разработки с дистрибутивом, что даст нам возможность разработки этих программ без обычных ограничений, связанных с управлением выпусками дистрибутива. Это также принесет пользу Ubuntu MATE, который автоматически получит новые функции, списки приложений и другие улучшения.

source: ## Developer tooling and collaboration
ru: ## Инструменты разработчика и сотрудничество

source: Ubuntu MATE and MATE Desktop will expand their use of continuous integration and automated testing in an effort to save the small development teams burning valuable time on activities best left to a bot.
ru: Ubuntu MATE и MATE Desktop будут расширять использование непрерывной интеграции и автоматизированного тестирования, чтобы сэкономить силы небольших команд разработчиков, которые тратят драгоценное время на действия, которые лучше всего доверить боту.

source: Additionally, we will review the development platforms and communication/ collaboration tools used by the MATE Desktop team to improve team communication and simplfy the project infrastructure where possible.
ru: Кроме того, мы рассмотрим платформы разработки и инструменты взаимодействия/ совместной работы, используемые командой MATE Desktop, чтобы улучшить взаимодействие команды и упростить инфраструктуру проекта, где это возможно.

source: ## Modern display server support
ru: ## Поддержка современного графического сервера

source: Wayland is set to become the defacto next generation display server. While Xorg has some years of usefulness remaining, now is the time to start planning for how MATE Desktop, and therefore Ubuntu MATE, implement support for Wayland.
ru: Wayland собирается стать по сути сервером отображения следующего поколения. Хотя Xorg еще несколько лет полезен, сейчас самое время начать планирование того, как MATE Desktop и, следовательно, Ubuntu MATE, будут реализовывать поддержку Wayland.

source: ## Voice command
ru: ## Голосовое управление

source: Smart speakers are growing in popularity and commanding mobile devices by voice is already common place. We will research how effectively voice commands can be integrated into Ubuntu MATE.
ru: Популярность умных колонок растет, и голосовое управление мобильными устройствами уже стало обычным делом. Мы исследуем, насколько эффективно голосовые команды могут быть интегрированы в Ubuntu MATE.

source: ## Accessibility
ru: ## Доступность

source: Making an accessible operating system was a key priority when the Ubuntu MATE founders initially set out the goals of the project.
ru: Создание доступной операционной системы было ключевым приоритетом, когда основатели Ubuntu MATE изначально определяли цели проекта.

source: While Ubuntu MATE is never going to be able to offer the comprehensive integration of assistive technologies that Sonar GNU/Linux provides, we will continue to follow their lead so that Ubuntu MATE is a viable desktop solution where computer access is shared within a household or business where individual needs differ.
ru: Хотя Ubuntu MATE никогда не сможет предложить комплексную интеграцию вспомогательных технологий, как это сделано в Sonar GNU/Linux, мы продолжим следовать их примеру, так что Ubuntu MATE станет жизнеспособным настольным решением, в котором доступ к компьютеру является общим для дома или бизнеса, где индивидуальные потребности различаются.

source: The upstream MATE Desktop team are actively engaged with visually impaired users from the Linux community to ensure their needs are met. This effort will likely never be complete, as it requires constant refinement.
ru: Команда разработчиков MATE Desktop активно взаимодействует с пользователями со слабым зрением из сообщества Linux, чтобы гарантировать удовлетворение их потребностей. Эта деятельность, скорее всего, никогда не будет завершена, поскольку она требует постоянного совершенствования.

source: ## Translation
ru: ## Перевод

source: Translation of Ubuntu and MATE desktop is handled upstream thanks to the tireless efforts of many translators, therefore the Ubuntu MATE operating system is available in many languages. However, this website is currently available in English only and we will work with the community to make it available in other languages.
ru: Перевод Ubuntu и рабочего стола MATE выполняется в апстриме благодаря неустанным усилиям многих переводчиков, поэтому операционная система Ubuntu MATE доступна на многих языках. Однако этот веб-сайт в настоящее время доступен только на английском языке, и мы будем работать с сообществом, чтобы сделать его доступным на других языках.

source: # Completed Objectives
ru: # Достигнутые цели

source: While these initiatives are considered "complete" they will of course be maintained and improved.
ru: Хотя эти инициативы считаются "завершенными", они, конечно, будут поддерживаться и улучшаться.

source: ## Artwork
ru: ## Внешний вид

source: Overhaul the Ubuntu MATE design language and make is consistent for web and desktop. Create a new wallpaper collection based on abstract designs and high quality photos.
ru: Переработка языка дизайна Ubuntu MATE и обеспечение его совместимости для отображения в Интернете и настольных компьютеров. Создание новой коллекции обоев на основе абстрактных рисунков и фотографий высокого качества.

# pages/faq-roadmap.md:97
source: :heavy_check_mark: *Implemented since Ubuntu MATE 18.04*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 18.04*

source: ## User experience
ru: ## Пользовательский опыт

source: I am reliably informed that everything is a *user experience* these days. User interfaces are, apparently, passé.
ru: Нам достоверно известно что все в настоящее время является *пользовательским опытом*. Пользовательские интерфейсы, по-видимому, в прошлом.

source: The MATE desktop offers a traditional desktop metaphor but it is also extremely customisable. When combined with some 3rd party applications Ubuntu MATE can be augmented to provide an "*experience*" similar to what other contemporary desktop environments offer while retaining its classic desktop paradigm.
ru: Рабочий стол MATE представляет собой традиционную метафору рабочего стола, но он также чрезвычайно настраиваемый. В сочетании с некоторыми сторонними приложениями Ubuntu MATE может быть расширен для обеспечения "*опыта*", аналогичного тому, что предлагают другие современные среды рабочего стола, при сохранении его классической парадигмы.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 16.04*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 16.04*

source: ## HiDPI support
ru: ## Поддержка HiDPI

source: High pixel density laptops and displays are becoming increasingly common and Ubuntu MATE needs to provide a first class HiDPI experience.
ru: Ноутбуки и дисплеи с высокой плотностью пикселей становятся все более распространенными, и Ubuntu MATE должен обеспечивать первоклассный опыт HiDPI.

# pages/faq-roadmap.md:117
source: :heavy_check_mark: *Implemented since Ubuntu MATE 18.04*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 18.04*

source: ## Launchers and Docks
ru: ## Панели запуска и доки

source: We will evaluate 3rd party launchers, such as Slingscold, [Synapse](http://mhr3.blogspot.com/2010/11/introducing-synapse-acetylcholine.html), [The Duck Launcher](https://github.com/the-duck/launcher) and 3rd party docks, such as [Plank](https://launchpad.net/plank), to see how they can be integrated with Ubuntu MATE to make user interaction with the desktop more efficient.
ru: Мы будем рассматривать сторонние программы запуска, такие как Slingscold, [Synapse](http://mhr3.blogspot.com/2010/11/introducing-synapse-acetylcholine.html), [The Duck Launcher](https://github.com/the-duck/launcher) и сторонние доки, такие как [Plank](https://launchpad.net/plank), чтобы увидеть как их можно интегрировать с рабочим столом Ubuntu MATE, чтобы сделать взаимодействие с рабочим столом более эффективным.

source: Launchers and docks are not to everyone's tastes so we will conduct community polls (just as we have done in the past) to determine if the selected 3rd party tools should be integrated as defaults or optional extras.
ru: Панели запуска и доки не всем по вкусу, поэтому мы проведем опросы сообщества (как мы уже делали в прошлом) для определения необходимости интеграции выбранных сторонних инструментов по умолчанию или как дополнительные.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 17.10 via Brisk Menu, MATE Menu and Super key support throughout MATE Desktop*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 17.10 посредством Brisk Menu, MATE Menu и поддержки Super клавиши повсеместно в MATE Desktop*

source: There are some hardcore Compiz addicts in the MATE community. That said Compiz will never be enabled by default in Ubuntu MATE, but we do want to cater for those people who want it. Compiz does include some features that are of real benefit, such as the Enhanced Zoom plug-in which is useful for individuals with low vision.
ru: В сообществе MATE есть несколько заядлых приверженцев Compiz. Тем не менее, Compiz никогда не будет включен по умолчанию в Ubuntu MATE, но мы хотим удовлетворить тех, кто этого хочет. Compiz действительно включает некоторые полезные функции, например, плагин Enhanced Zoom, который полезен для людей с ослабленным зрением.

source: The Ubuntu MATE team will create a simple way for Compiz to be installed and enabled for those users who want it.
ru: Команда Ubuntu MATE создаст простой способ установки и включения Compiz для тех пользователей, которые этого хотят.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.04*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.04*

source: There are a plethora of options behind MATE that are not yet exposed via control centre applets. The Ubuntu MATE team have already provided a simple tool to tweak your MATE configuration called MATE Tweak and over time that tool be be enhanced and improved.
ru: В MATE есть множество опций, которые еще не доступны через апплеты центра управления. Команда Ubuntu MATE уже предоставила простой инструмент для настройки вашей конфигурации MATE под названием MATE Tweak, и со временем этот инструмент будет улучшаться и совершенствоваться.

source: A number of different panel layouts are already available in Ubuntu MATE. Panel layouts that offer a pure MATE desktop will continue to be made available and others added that may also rely on 3rd party launchers, docks or even Compiz. We will provide a tool to switch between these different desktop layouts that also enables/disables the appropriate launchers and docks where required.
ru: В Ubuntu MATE уже доступен ряд различных конфигураций панелей. Конфигурации панелей включают помимо исходного рабочего стола MATE, другие варианты их расположения, включающие сторонние программы запуска, доки и даже Compiz. Мы также предоставим инструмент для переключения между этими различными макетами рабочего стола, которые также включают/отключают соответствующие программы запуска и доки, где это необходимо.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.04 via **MATE Tweak***
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.04 посредством **MATE Tweak***

source: ## Complex input methods
ru: ## Сложные методы ввода

source: We've received feedback that complex input method support in Ubuntu MATE could be better.
ru: Мы получили отзывы о том, что поддержка сложных методов ввода в Ubuntu MATE могла бы быть лучше.

source: MATE does have support for complex input methods right now, but having spoken to some users in China and Japan, we now better understand their requirements. To that end we've documented how to install and enable IBus and fcitx on the [download page](/download/). That was just the first step in ensuring everyone is catered for and in the future we will integrate either [IBus](https://code.google.com/p/ibus/) or [fcitx](https://fcitx-im.org/) into Ubuntu MATE to address this short coming.
ru: MATE прямо сейчас поддерживает сложные методы ввода, но, поговорив с некоторыми пользователями из Китая и Японии, мы теперь лучше понимаем их требования. С этой целью мы задокументировали как установить и включить IBus и fcitx на [странице загрузки](/download/). Это был лишь первый шаг к тому, чтобы все были довольны, и в будущем мы будем интегрировать либо [IBus](https://code.google.com/p/ibus/), либо [fcitx](https://fcitx-im.org/) в Ubuntu MATE, чтобы устранить этот недостаток.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.10*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.10*

source: ## Application install
ru: ## Установка программ

source: Users new to Linux are often overwhelmed by the vast choice of software on offer. The Ubuntu MATE team will create a curated selection of applications suitable for use with Ubuntu MATE that can be installed via one click.
ru: Пользователи, плохо знакомые с Linux, часто бывают ошеломлены огромным выбором предлагаемого программного обеспечения. Команда Ubuntu MATE создаст тщательно подобранный набор приложений, подходящих для использования с Ubuntu MATE, которые можно установить одним щелчком мыши.

source: The Ubuntu MATE community will select one application that is more suitable for a given task or activity so that new users can quickly turn their Ubuntu MATE workstation into a productive tool.
ru: Сообщество Ubuntu MATE выберет одно приложение, которое больше подходит для данной задачи или деятельности, чтобы новые пользователи могли быстро превратить свою рабочую станцию Ubuntu MATE в продуктивный инструмент.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.10 via **Ubuntu MATE Welcome***
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.10 посредством **Ubuntu MATE Welcome***

source: ## Media casting and streaming
ru: ## Медиа-кастинг и потоковая передача

source: Seamless integration with home media server content and media casting devices is essential in order for Ubuntu MATE to remain relevant for many home users. We will try to deliver on that.
ru: Полная интеграция с домашним медиасервером и устройствами трансляции мультимедиа важна для того, чтобы Ubuntu MATE оставался актуальным для многих домашних пользователей. Мы постараемся это сделать.

source: Similarly being able to access popular subscription-based streaming services such as Netflix, Amazon Instant Video and Spotify is also an expectation for many users. While the Ubuntu MATE team can do little to deliver the technologies to make this happen, we can provide simple installation options to enable access to these services, and where possible, ship the required software by default.
ru: Точно так же возможность доступа к популярным потоковым сервисам на основе подписки, таким как Netflix, Amazon Instant Video и Spotify, также является ожиданием для многих пользователей. Хотя команда Ubuntu MATE мало что может сделать для предоставления необходимых технологий, мы можем предоставить простые варианты установки, чтобы обеспечить доступ к этим службам, и, где это возможно, поставлять необходимое программное обеспечение по умолчанию.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.10 by using Software Boutique to install Google Chrome, Spotify or Pithos*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.10 посредством Software Boutique для установки Google Chrome, Spotify или Pithos*

source: ## Mobile device integration
ru: ## Интеграция с мобильными устройствами

source: Currently Ubuntu MATE has the essential mobile device support you'd expect. You can plug in a phone or a media player and the device is automatically detected and mounted, you can then access the files on it.
ru: В настоящее время Ubuntu MATE имеет необходимую поддержку мобильных устройств. Вы можете подключить телефон или медиаплеер, и устройство будет автоматически обнаружено и подключено, после чего вы сможете получить доступ к файлам на нем.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 15.10*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 15.10*

source: Mobile device notifications can be wirelessly mirrored to your Ubuntu MATE desktop and for you to be able to send files or links wirelessly between your mobile devices and Ubuntu MATE.
ru: Уведомления мобильного устройства могут быть беспроводным образом отражены на вашем рабочем столе Ubuntu MATE, чтобы вы могли отправлять файлы или ссылки по беспроводной сети между вашими мобильными устройствами и Ubuntu MATE.

source: :heavy_check_mark: *Implemented since Ubuntu MATE 16.04 by using the Software Boutique to install KDE Connect Indicator*
ru: :heavy_check_mark: *Реализовано начиная с Ubuntu MATE 16.04 посредством Software Boutique для установки KDE Connect Indicator*
