Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-verify-secure.po
Languages: ru

source: title: Verifying Downloads
ru: title: Верификация загрузок

source: ## Verify for Tampering
ru: ## Проверка достоверности

source: This method will verify the signature on the `SHA256SUMS` checksum file. By proving that this file's digital signature belongs to Ubuntu, you can be confident using these checksums to verify the downloaded files haven't been tampered or corrupted.
ru: Этот метод проверяет цифровую подпись файла `SHA256SUMS` контрольных сумм. Убедившись, что цифровая подпись принадлежит Ubuntu, вы можете с уверенностью использовать эти контрольные суммы чтобы удостовериться, что загруженные файлы не были подделаны или повреждены.

source: ## Preperations
ru: ## Подготовка

source: We recommend using the [Windows Subsystem for Linux (WSL)](https://docs.microsoft.com/en-us/windows/wsl/faq), which allows you to run Ubuntu within Windows. This will provide a GNU/Linux environment for running GPG and checksum commands.
ru: Мы рекомендуем использовать [Windows Subsystem for Linux (WSL)](https://docs.microsoft.com/en-us/windows/wsl/faq), которая позволяет запустить Ubuntu внутри Windows. Таким образом вы получите доступ к среде GNU/Linux для запуска команд для GPG и контрольных сумм.

source: For help setting up this environment, please see:
ru: Для настройки такой среды, пожалуйста, посмотрите:

# pages/faq-verify-secure.md:35
source: Once installed, jump to the [steps](#steps) section.
ru: После установки перейдите к разделу [шаги](#шаги).

source: You'll need to install GnuPG (utility for verifying the signature) and `sha256sum` (for verifying the checksum). We recommend installing this via [Homebrew](https://brew.sh/), a command line package manager for macOS.
ru: Вам потребуется установить GnuPG (утилиту для проверки цифровой подписи) и `sha256sum` (для проверки контрольной суммы). Мы рекомендуем выполнить их установку через терминальный пакетный менеджер для macOS [Homebrew](https://brew.sh/).

source: 1. Install: <https://brew.sh/> 2. Run:
ru: 1. Установите: <https://brew.sh/> 2. Запустите:

# pages/faq-verify-secure.md:50
source: Once installed, jump to the [steps](#steps) section.
ru: После установки перейдите в раздел [шаги](#шаги).

source: Most, if not all, distros (including Ubuntu MATE) comes preloaded with packages that provide `gnupg` and `sha256sum`. If yours doesn't, you can install these via your distro's package manager.
ru: Большинство, если не все, дистрибутивов (включая Ubuntu MATE), имеют предустановленными пакеты с программами `gnupg` и `sha256sum`. Если они у вас еще не установлены, то вы можете их установить с помощью менеджера управления пакетами вашего дистрибутива.

source: In Ubuntu, `sha256sum` is provided in `coreutils`.
ru: В Ubuntu, `sha256sum` содержится в пакете `coreutils`.

source: ## Steps
ru: ## Шаги

source: ### 1. Obtain the checksums and signature
ru: ### 1. Загрузка контрольных сумм и цифровой подписи

source: For downloads provided by Canonical:
ru: Для загрузок, предоставляемых Canonical:

source: * <http://cdimages.ubuntu.com/ubuntu-mate/releases/> * Download the `SHA256SUM` and `SHA256SUM.gpg` files.
ru: * <http://cdimages.ubuntu.com/ubuntu-mate/releases/> * Загрузите файлы `SHA256SUM` и `SHA256SUM.gpg`.

source: > > **Canonical's download server is HTTP! Is this secure?** > > This is a question that commonly asked. We use Canonical's infrastructure > being an official Ubuntu flavour. Many archive mirrors do not use > SSL to reduce the overhead of HTTPS. > > The GPG fingerprint is validated against the Ubuntu keyserver. > So, regardless of where you obtained the file, if the signature matches, > you can trust the file. >
ru: > > **Сервер загрузок Canonical использует HTTP! Разве это безопасно?** > > Такой вопрос задается достаточно часто. Мы используем инфраструктуру Canonical > будучи официальной редакцией Ubuntu. Много зеркал с архивами не используют > SSL для уменьшения накладных расходов, вызываемых HTTPS. > > Цифровая подпись GPG проверяется с помощью сервера ключей Ubuntu. > Поэтому, независимо от места получения вами файла, вы можете ему доверять > при совпадении цифровой подписи. >

source: Or for device ports provided by us:
ru: Или для предоставляемых нами портов для устройств:

source: * <https://releases.ubuntu-mate.org> * Download the `.sha256` and `.sha256.sign` files.
ru: * <https://releases.ubuntu-mate.org> * Загрузите файлы `.sha256` и `.sha256.sign`.

source: First, let's find out if you have the signature key:
ru: Вначале нужно проверить наличие ключа подписи:

# pages/faq-verify-secure.md:92
source: Or:
ru: Или:

source: If this says:
ru: Если вы видите:

source: > > gpg: Signature made Thursday, October 17, 2019 PM03:13:47 BST > > gpg: using DSA key 46181433FBB75451 > > **gpg: Can't check signature: No public key** > > gpg: Signature made Thursday, October 17, 2019 PM03:13:47 BST > > gpg: using RSA key D94AA3F0EFE21092 > > **gpg: Can't check signature: No public key** >
ru: > > gpg: Подпись сделана Четверг, 17 Октябрь 2019 PM03:13:47 BST > > gpg: ключом DSA с идентификатором 46181433FBB75451 > > **gpg: Не могу проверить подпись: Нет открытого ключа** > > gpg: Подпись сделана Четверг, 17 Октябрь 2019 PM03:13:47 BST > > gpg: ключом RSA с идентификатором D94AA3F0EFE21092 > > **gpg: Не могу проверить подпись: Нет открытого ключа** >

source: If you don't have the public key, see **step 2**, otherwise skip to **step 3**.
ru: Если у вас нет открытого ключа, то используйте **шаг 2**, а в противном случае можете его пропустить и перейти к **шагу 3**.

source: ### 2. Retrieve the key (if applicable)
ru: ### 2. Получение ключа (если необходимо)

source: Here's how to securely download the signature key from the keyserver. This only needs to be performed once, except in the rare situation the keys were updated.
ru: Ниже представлен способ загрузки ключа подписи с сервера ключей. Это однократная операция с тем исключением, что ключи могли быть обновлены.

source: In this instance, the two keys are `46181433FBB75451` and `D94AA3F0EFE21092`. Run this command, but add `0x` to the start of both these keys, like so:
ru: В этом конкретном случае нам нужны два ключа - `46181433FBB75451` и `D94AA3F0EFE21092`. Используйте команду ниже с добавлением `0x` в начало каждого из этих ключей, т.е.:

source: You should get an output like this:
ru: Вы получите вывод похожий на:

source: > > gpg: key D94AA3F0EFE21092: public key "Ubuntu CD Image Automatic Signing Key (2012) <cdimage@ubuntu.com>" imported > > gpg: key 46181433FBB75451: 110 signatures not checked due to missing keys > > gpg: key 46181433FBB75451: public key "Ubuntu CD Image Automatic Signing Key <cdimage@ubuntu.com>" imported > > gpg: no ultimately trusted keys found > > gpg: Total number processed: 2 > > gpg: imported: 2 >
ru: > > gpg: ключ D94AA3F0EFE21092: импортирован открытый ключ "Ubuntu CD Image Automatic Signing Key (2012) <cdimage@ubuntu.com>" > > gpg: ключ 46181433FBB75451: 110 подписей не проверено за отсутствием ключа > > gpg: ключ 46181433FBB75451: импортирован открытый ключ "Ubuntu CD Image Automatic Signing Key <cdimage@ubuntu.com>" > > gpg: абсолютно доверенных ключей не найдено > > gpg: Всего обработано: 2 > > gpg: импортировано: 2 >

# pages/faq-verify-secure.md:141
source: Or:
ru: Или:

source: > gpg: key 7454357CFFEE1E5C: public key "Martin Wimpress <martin@wimpress.org>" imported > gpg: Total number processed: 1 > gpg: imported: 1
ru: > gpg: ключ 7454357CFFEE1E5C: импортирован открытый ключ "Martin Wimpress <martin@wimpress.org>" > gpg: Всего обработано: 1 > gpg: импортировано: 1

source: Suspicions should arise if the public key belongs to a random stranger, or looks forged.
ru: Подозрения должны возникнуть в случаях если открытый ключ принадлежит случайному проходимцу или выглядит поддельно.

source: ### 3. Is it a match?
ru: ### 3. Есть совпадение?

source: Run this command:
ru: Выполните команду:

source: And the output:
ru: Посмотрите ее вывод:

source: > > gpg: Signature made Thursday, October 17, 2019 PM03:13:47 BST > > gpg: using DSA key 46181433FBB75451 > > **gpg: Good signature from "Ubuntu CD Image Automatic Signing Key <cdimage@ubuntu.com>" [unknown]** > > gpg: WARNING: This key is not certified with a trusted signature! > > gpg: There is no indication that the signature belongs to the owner. > > Primary key fingerprint: C598 6B4F 1257 FFA8 6632 CBA7 4618 1433 FBB7 5451 > > gpg: Signature made Thursday, October 17, 2019 PM03:13:47 BST > > gpg: using RSA key D94AA3F0EFE21092 > > **gpg: Good signature from "Ubuntu CD Image Automatic Signing Key (2012) <cdimage@ubuntu.com>" [unknown]** > > gpg: WARNING: This key is not certified with a trusted signature! > > gpg: There is no indication that the signature belongs to the owner. > > Primary key fingerprint: 8439 38DF 228D 22F7 B374 2BC0 D94A A3F0 EFE2 1092 >
ru: > > gpg: Подпись сделана Четверг, 17 Октября 2019 PM03:13:47 BST > > gpg: ключом DSA с идентификатором 46181433FBB75451 > > **gpg: Действительная подпись пользователя "Ubuntu CD Image Automatic Signing Key <cdimage@ubuntu.com>" [неизвестно]** > > gpg: Внимание: Данный ключ не заверен доверенной подписью! > > gpg: Нет указаний на то, что подпись принадлежит владельцу. > > Отпечаток первичного ключа: C598 6B4F 1257 FFA8 6632 CBA7 4618 1433 FBB7 5451 > > gpg: Подпись сделана Четверг, 17 Октября 2019 PM03:13:47 BST > > gpg: ключом RSA с идентификатором D94AA3F0EFE21092 > > **gpg: Действительная подпись пользователя "Ubuntu CD Image Automatic Signing Key (2012) <cdimage@ubuntu.com>" [неизвестно]** > > gpg: Внимание: Данный ключ не заверен доверенной подписью! > > gpg: Нет указаний на то, что подпись принадлежит владельцу. > > Отпечаток первичного ключа: 8439 38DF 228D 22F7 B374 2BC0 D94A A3F0 EFE2 1092 >

source: Note the **bold** lines which confirm the file was signed by the team over at Ubuntu. If this wasn't genuine, the result would be **BAD signature**.
ru: Обратите внимание на **полужирные** строки, которые подтверждают подпись файлов командой в Ubuntu. Если это не так, то результатом является **НЕПРАВИЛЬНАЯ подпись**.

source: The "key is not certified" message is simply because you haven't explictly told GnuPG to trust this key. This is optional. You can [learn more about GnuPG on the wiki page](https://help.ubuntu.com/community/GnuPrivacyGuardHowto).
ru: Сообщение "Данный ключ не заверен доверенной подписью!" возникает из-за того, что мы не сказали GnuPG о необходимости доверять этому ключу. Это не обязательно. Вы можете [узнать больше о GnuPG на странице](https://help.ubuntu.com/community/GnuPrivacyGuardHowto).

source: ### 4. Verify the ISOs
ru: ### 4. Верификация файлов ISO

source: Now we know the checksum file is untampered with, you can proceed to verify for corruption as normal.
ru: Теперь мы знаем, что файл контрольной суммы не был подделан, поэтому мы можем проверять целостность как обычно.

source: sha256sum -c SHA256SUMS 2>&1 | grep OK
ru: sha256sum -c SHA256SUMS 2>&1 | grep -E 'OK|ЦЕЛ'

source: You should see "OK" in its output:
ru: Вы должны увидеть сообщение "ЦЕЛ" (или "OK") в результате:

source: ubuntu-mate-20.04-desktop-amd64.iso: OK
ru: ubuntu-mate-20.04-desktop-amd64.iso: ЦЕЛ

source: An empty output would indicate the file is corrupt and should re-downloaded again.
ru: Пустая строка будет означать, что файл поврежден и вам следует загрузить его повторно.

source: There are other ways to perform checksum checks that don't require a Terminal, take a look at our [Verify for corruption](/faq/verify-download-quick/) for details.
ru: Существуют другие способы проверки целостности, которые не требуют использования терминала, посмотрите страницу [Проверка целостности](/faq/verify-download-quick/) для подробностей.

source: _This page is an adaptation of [Ubuntu's verification tutorial](https://discourse.ubuntu.com/t/14010)._
ru: _Эта страница является адаптацией [руководства верификации Ubuntu](https://discourse.ubuntu.com/t/14010)._
