Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-downloads.po
Languages: ru

source: title: Download Help
ru: title: Помощь с загрузками

source: # What should I download?
ru: # Что мне следует загрузить?

source: This page aims to address common questions for new users.
ru: Эта страница предназначена для ответов на общие вопросы новых пользователей.

source: ## Which architecture?
ru: ## Какую архитектуру выбрать?

source: * **amd64** is for a desktop or laptop computer built around 2005 and later. While the name may suggest otherwise, this supports both AMD and Intel processors capable of 64-bit instructions, BIOS and UEFI motherboards as well as PC/Mac computers.
ru: * **amd64** предназначена для компьютеров и ноутбуков, выпущенных около 2005 года и позднее. Хотя из названия может показаться другое, она поддерживает процессоры AMD и Intel, способные исполнять 64-битные инструкции, материнские платы с BIOS и UEFI а также ПК/Mac.

source: * **i386** has been discontinued and will no longer receive updates after April 2021. This one runs on any 32-bit PC or Intel Mac.
ru: * **i386** считается устаревшей и не будет более получать обновления после апреля 2021 года. Работает в 32-битных ПК или Intel Mac.

source: * **armhf** is for the Raspberry Pi and other compatible microcomputers. This one is 32-bit, but is recommended.
ru: * **armhf** предназначена для Raspberry Pi и других микрокомпьютеров. Она 32-битная, но при этом является рекомендуемой.

source: * **arm64** is the 64-bit version ideal for users that intend to run complex applications that will benefit from a 64-bit instruction set.
ru: * **arm64** является 64-битной и идеально подходит для тех пользователей, которые собираются использовать сложные программы, использование 64-битных инструкций в которых оказывается выигрышным.

source: **Historic**
ru: **Исторические**

source: * **powerpc** is for non-Intel Macs before 2006 and compatible IBM PowerPC machines. New downloads for these are no longer available.
ru: * **powerpc** предназначена для не-Intel Mac, выпущенных до 2006 года и совместимых с архитетурой IBM PowerPC. Новые загрузки для этой архитектуры более недоступны.

source: **Ubuntu MATE Exclusive**
ru: **Эксклюзивы Ubuntu MATE**

source: * If you have an ultra mobile PC (UMPC), like certain GPD branded models or a Topjoy Falcon, we have builds designed specifically for that hardware.
ru: * Если у вас есть ультра-мобильный компьютер (УМПК) типа производимых компанией GPD моделей или Topjoy Falcon, то у нас есть специально подготовленные сборки для таких устройств.

source: More details can be [found on our UMPC page](/ports/umpcs/).
ru: Более подробно вы можете узнать о них [на нашей странице УМПК](/ports/umpcs/).

source: ## Which release?
ru: ## Какую версию выбрать?

source: * Choose an **LTS** (Long Term Release) if you prefer **stability**. These are supported for **3 years** with a new upgrade available every **2 years**.
ru: * Выбирайте версию **LTS** (Long Term Release, т.е. с долгосрочной поддержкой) если вы предпочитаете **стабильность**. Такие версии поддерживаются **3 года** с возможностью обновления каждые **2 года**.

source: * Choose a **non-LTS** (interim) release if you like the **latest features**. These are released more frequently (every 6 months) but are only supported for 9 months.
ru: * Выбирайте **не-LTS** версию (промежуточную) если вы предпочитаете **новейшие функции**. Такие версии выходят более часто (раз в 6 месяцев) и поддерживаются всего 9 месяцев.

source: Both releases equally receive security updates provided by the Ubuntu team. You may upgrade from an LTS to a non-LTS releases by changing your preferences in the **Software & Updates** application.
ru: Оба типа версий в одинаковой степени получают обновления безопасности от команды Ubuntu. Вы можете обновить LTS версию на не-LTS если измените настройки в приложении **Программы и обновления**.

source: ## Which download method?
ru: ## Какой метод загрузки использовать?

source: Instead of downloading from one source, BitTorrent retrieves and verifies the file from many computers. This can help save bandwidth costs for the host, be paused/resumed and in many cases achieve faster download speeds.
ru: Вместо того, чтобы загружать файл из одного источника, BitTorrent получает и верифицирует его от нескольких компьютеров. Это позволяет ументшить стоимость трафика на стороне сервера, дает возможность приостановки/восстановления загузки и во многих случаях позволяет увеличить скорость загрузки.

source: If you already have a BitTorrent client installed, a **magnet link** will open it automatically.
ru: Если у вас уже установлен клиент BitTorrent, то нажатие на **magnet-ссылку** откроет его автоматически.

source: ### Direct Download
ru: ### Прямая загрузка

source: This is your standard download straight from the server to your browser (over HTTP/S). It is [recommended to verify the download](/faq/verify-download-quick/) using the provided checksum afterwards to be sure it was downloaded in one piece.
ru: Это стандартный способ загрузки непосредственно с нашего сервера в ваш веб-браузер через HTTP/S. При этом [рекомендуется верифицировать загрузку](/faq/verify-download-quick/) воспользовавшись предоставленной контрольной суммой, чтобы убедиться в целостности загруженного файла.

source: ## Can I order a disc or USB drive?
ru: ## Могу ли я заказать компакт-диск или USB-накопитель?

source: Unfortunately, we do not have any suppliers to provide this service.
ru: К сожалению, у нас нет поставщиков, которые могли бы предоставить эту услугу.
