Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-project.po
Languages: ru

source: title: Project Questions
ru: title: Вопросы о проекте

source: # FAQs
ru: # Частые вопросы и ответы

source: If we get asked something frequently enough we’ll try to provide the answers here.
ru: Если нам задают вопрос достаточно часто, то мы стараемся помещать ответ на него здесь.

source: ### What is Ubuntu MATE exactly?
ru: ### Что такое Ubuntu MATE?

source: See our [What is Ubuntu MATE?](/about/) page.
ru: Смотрите нашу страницу [о проекте](/about/).

source: ### Is Ubuntu MATE an official Canonical project?
ru: ### Является ли Ubuntu MATE официальным проектом Canonical?

source: No, it is an Ubuntu community project.
ru: Нет, это проект сообщества Ubuntu.

source: ### OK, so who is behind Ubuntu MATE?
ru: ### Хорошо, а кто стоит за Ubuntu MATE?

source: Take a look at [our team page](/about/team/) to see the all-star cast who have made Ubuntu MATE possible.
ru: Посмотрите [страницу нашей команды](/about/team/) чтобы увидеть весь звездный состав, обеспечивающий существование проекта Ubuntu MATE.

source: ### Is Ubuntu MATE an official Ubuntu “flavour”?
ru: ### Является ли Ubuntu MATE официальной редакцией Ubuntu?

source: Yes.
ru: Да.

source: ### Why is xyz application installed by default when I prefer abc application?
ru: ### Почему приложение xyz предустановлено по умолчанию при том что я предпочитаю использовать abc вместо него?

source: In general, the default application selection follows what shipped in Ubuntu. The only reason we deviate from the default Ubuntu applications is if they are not compatible with Ubuntu MATE or pull in lots of unnecessary dependencies.
ru: Обычно мы используем те же приложения по умолчанию, что используется в Ubuntu. Причиной возможных отличий может быть несовместимость приложений Ubuntu со средой рабочего стола Ubuntu MATE или необходимость установки большого количества ненужных зависимостей для работы программы.

source: The reason for using the default applications as shipped by Ubuntu is that they are supported by the Ubuntu Desktop team. The Ubuntu MATE team is rather small so sharing the support responsibility makes sense, both for us and our users.
ru: Причиной использования приложения по умолчанию из Ubuntu является тот факт, что такое приложение поддерживается командой разработки Ubuntu Desktop. Команда Ubuntu MATE достаточно мала, поэтому разделение ответственности за поддержку имеет смысл как для нас, так и для наших пользователей.

source: ### Why is xyz application installed default when abc application is better?
ru: ### Почему приложение xyz предустановлено при условии, что приложение abc лучше?

source: See the answer to the question above.
ru: Смотрите ответ на вопрос выше.

source: ### Will Ubuntu MATE run on my computer? If you have a computer from [Entroware](https://www.entroware.com/store/), System76, ZaReason, Think Penguin or some models from Dell such as the XPS 13 Developer Edition, then Ubuntu MATE will absolutely run on your computer.
ru: ### Будет ли Ubuntu MATE работать на моем компьютере? Если ваш компьютер от [Entroware](https://www.entroware.com/store/), System76, ZaReason, Think Penguin или относится к некоторым моделям Dell, таким как XPS 13 Developer Edition, то Ubuntu MATE будет прекрасно работать на таком устройстве.

source: Computers from major PC vendors such as Acer, ASUS, HP and Lenovo will most likely run Ubuntu MATE just fine too.
ru: Компьютеры от ведущих производителей, таких как Acer, ASUS, HP и Lenovo с большой степенью вероятности тоже позволят Ubuntu MATE хорошо работать.

source: Ubuntu MATE is designed to run on almost any computer hardware. Of course Ubuntu MATE runs particularly well on the newest, fastest hardware, but it also runs well on computers manufactured in the last decade. In fact, an older computer designed during the Windows XP era, can easily be outfitted with the new, modern and fully-supported Ubuntu MATE and it will likely run better than it did with the previously installed operating system.
ru: Ubuntu MATE спроектирована для работы практически на любом компьютерном оборудовании. Особенно хорошо Ubuntu MATE работает на новейшем и быстрейшем оборудовании, но также хорошо работает на компьютерах последнего десятилетия. На самом же деле, более старый компьютер, созданный в эпоху Windows XP, может быть легко преображен использованием современной и полностью-поддерживаемой системы Ubuntu MATE, и, он, вероятно, будет работать даже лучше, чем с ранее установленной операционной системой.

source: ### Can I use iTunes on Ubuntu MATE?
ru: ### Могу ли я использовать iTunes в Ubuntu MATE?

source: No. This is one of those programs that is specifically designed by Apple NOT to run on Linux. Although macOS has its roots in the same UNIX philosophy as Linux, macOS is not the same as Linux, and applications written for Apple’s operating system do not automatically run on Linux. However Spotify is available for Ubuntu MATE and there are plenty of alternative media players that will play music, create play lists, sync with mobile devices, and retrieve, manage and play podcasts. Rythmbox is provided with Ubuntu MATE and can play any of the music or podcasts in your iTunes library.
ru: Нет. Это одно из тех приложений, специально созданных Apple НЕ для работы под Linux. Хотя macOS имеет свои корни в той же философии UNIX, что и Linux, macOS - это не то же самое, что Linux, и приложения, написанные для операционной системы Apple, не запускаются автоматически в Linux. Однако Spotify доступен для Ubuntu MATE, и существует множество альтернативных медиаплееров, которые будут воспроизводить музыку, создавать списки воспроизведения, синхронизироваться с мобильными устройствами, а также извлекать, управлять и воспроизводить подкасты. Rythmbox поставляется с Ubuntu MATE и может воспроизводить любую музыку или подкасты из вашей библиотеки iTunes.

source: ### Is Ubuntu MATE secure and safe to use?
ru: ### Является ли Ubuntu MATE надежной и безопасной системой?

source: Ubuntu MATE is designed with security in mind. Unlike operating systems that update only once a month, Ubuntu MATE receives updates continuously. The updates include security patches for Ubuntu MATE and all of its components. Security updates for all of its installed applications are also provided on the same schedule. This ensures that you have the latest protection for all of your computer’s software, as soon as it’s available! Is Ubuntu MATE more secure than other operating systems?
ru: Ubuntu MATE разработан с учетом требований безопасности. В отличие от операционных систем, которые обновляются только раз в месяц, Ubuntu MATE получает обновления постоянно. Обновления включают исправления безопасности для Ubuntu MATE и всех его компонентов. Обновления безопасности для всех установленных приложений также предоставляются по тому же графику. Это гарантирует, что у вас будет новейшая защита для всего программного обеспечения вашего компьютера, как только оно будет доступно! Ubuntu MATE более безопасен, чем другие операционные системы?

source: We think that security on Linux systems like Ubuntu MATE is superior. Ubuntu MATE users are not administrators by default. Administrators (“root” users) on any computer system have permission to do anything they want, including the ability to damage the system.
ru: Мы считаем, что безопасность в системах Linux, таких как Ubuntu MATE, лучшая. Пользователи Ubuntu MATE по умолчанию не являются администраторами. Администраторы (пользователи “root”) в любой компьютерной системе имеют право делать все, что захотят, включая возможность повредить систему.

source: For example, other operating systems look at the name of a file to determine which program should open it, then immediately attempt to open it! That design makes it easy for an intruder to attack a computer. Ubuntu MATE opens a file based on what the file is, not based on its name. So even if a malicious program disguises its identity by using the name “Last Will and Testament.txt” Ubuntu MATE will recognize the file as a program. The system provides a warning that the file is not a text file, but that it is a program that will be run if you give it permission to continue. To be extra secure, Ubuntu MATE requires you to provide your administrator password before that permission is granted. Every single time.
ru: Например, другие операционные системы смотрят на имя файла, чтобы определить, какая программа должна его открыть, а затем сразу же пытаются открыть его! Такой дизайн позволяет злоумышленнику легко атаковать компьютер. Ubuntu MATE открывает файл на основании внутренней структуры файла, а не его имени. Таким образом, даже если вредоносная программа маскируется с помощью имени «Последняя воля и завещание.txt», Ubuntu MATE распознает файл как программу. Система выдаст предупреждение о том, что файл не является текстовым файлом, а является программой, которая будет запущена, если вы дадите ей разрешение на продолжение. Для обеспечения дополнительной безопасности Ubuntu MATE требует, чтобы вы предоставили пароль администратора, прежде чем это разрешение будет предоставлено. Каждый раз.

source: ### Can Ubuntu MATE get computer viruses and malware?
ru: ### Может ли Ubuntu MATE быть заражена вирусами и вредоносными программами?

source: Ubuntu MATE can get viruses and other infections… but it doesn’t. Rapid and timely updates ensure that there are very few, if any threats to Linux systems like Ubuntu MATE that persist in the wild. In reality, there have been very few “public” infections in the last 10 years that can affect Ubuntu MATE. They are no longer a threat to anyone installing or using a modern Linux distribution today. Ubuntu MATE is designed to make it difficult for viruses, root kits and other malware to be installed and run without conscious intervention by you, the user. Even if you do accidentally invite in an infection, chances are it’s designed to attack Windows and won’t do much, if any damage to Ubuntu MATE.
ru: Ubuntu MATE может заразиться вирусами и другими инфекциями… но это не так. Быстрые и своевременные обновления гарантируют, что существует очень мало угроз для систем Linux, таких как Ubuntu MATE, если они вообще существуют. На самом деле за последние 10 лет было очень мало «публичных» заражений, которые могли бы повлиять на Ubuntu MATE. Они больше не представляют угрозы для тех, кто сегодня устанавливает или использует современный дистрибутив Linux. Ubuntu MATE разработан, чтобы усложнить воздействие вирусов, руткитов и других вредоносных программ, которые могли бы быть установлены и запущены без сознательного вмешательства со стороны вас, пользователя. Даже если вы случайно примите зараженный файл, то скорее всего окажется, что он предназначен для атаки на системы Windows и не принесет большого вреда Ubuntu MATE.

source: ### How can Ubuntu MATE be free?
ru: ### Почему Ubuntu MATE бесплатна?

source: What Linux, Ubuntu and MATE Desktop all have in common is they are Open Source. Open Source software is software that can be freely used, changed, and shared (in modified or unmodified form) by anyone. In a nutshell Ubuntu MATE is free, in the truest sense of the word.
ru: Linux, Ubuntu и MATE Desktop объединяет одно - они все имеют открытый исходный код. Программное обеспечение с открытым исходным кодом может быть свободно использовано, распространено (в измененной или неизменной формах) кем угодно. Короче говоря, Ubuntu MATE бесплатен и свободен в прямом смысле этого слова.

source: Although you will find some versions (distributions) of Linux for purchase, the vast majority are provided free of charge, like Ubuntu MATE. Open Source software is licensed in a way that allows anyone to give it away for free, no strings attached. For example, the licence gives any member of the user community the freedom to use Linux for any purpose, to distribute, modify, redistribute, or even sell the operating system. If you do modify and then redistribute Linux with your modifications, you are required by the licence to submit your modifications for possible inclusion into future versions. There is no guarantee that this will ever happen, but if you have made it better, then your changes just might be included in the next release of Ubuntu MATE.
ru: Хотя вы найдете некоторые версии (дистрибутивы) Linux для покупки, подавляющее большинство из них предоставляется бесплатно, например Ubuntu MATE. Программное обеспечение с открытым исходным кодом лицензируется таким образом, чтобы каждый мог раздавать его бесплатно, без каких-либо условий. Например, лицензия дает любому члену сообщества пользователей свободу использовать Linux для любых целей, распространять, изменять или даже продавать операционную систему. Если вы модифицируете, а затем распространяете Linux с вашими модификациями, по лицензии вы должны представить свои модификации для возможного включения в будущие версии. Нет никакой гарантии, что это когда-либо произойдет, но если вы сделали это лучше, ваши изменения могут быть включены в следующий выпуск Ubuntu MATE.

source: Many of the users of Linux are corporations that use the operating system to run their businesses, or include it within their products. Many of these corporations provide fixes and new features for Linux as they use the software for their businesses. These improvements are given back to the Linux community and Ubuntu MATE improves as a result.
ru: Многие из пользователей Linux - корпорации, которые используют операционную систему для ведения своего бизнеса или включают ее в свои продукты. Многие из этих корпораций предоставляют исправления и новые функции для Linux, поскольку они используют программное обеспечение для своего бизнеса. Эти улучшения возвращаются в сообщества Linux и Ubuntu MATE, и в результате программное обеспечение улучшается.

source: This is how we can continually improve and grow without having to charge our users money.
ru: Таким образом мы можем постоянно улучшаться и расти, не взимая с наших пользователей деньги.

source: ### I’ve got a question. Where do I ask?
ru: ### Где я могу задавать вопросы?

source: Ask the [Ubuntu MATE community](/community/).
ru: Задавайте вопрос в [сообществе Ubuntu MATE](/community/).

source: ### What has Ubuntu MATE got planned for the future?
ru: ### Что у Ubuntu MATE запланировано на будущее?

source: Hopefully our [roadmap](/faq/roadmap/) outlines some of what we have planned. If you have any ideas yourself, we’d love to hear from you.
ru: Надеемся, что [наш оперативный план](/faq/roadmap/) описывает кое-что из того, что мы запланировали. Если у вас есть какие-либо идеи, мы с удовольствием к ним прислушаемся.
