Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-usbimage.po
Languages: ru

source: title: Preparing a USB Image
ru: title: Подготовка USB образа

source: ## What is bootable media?
ru: ## Что представляет собой загрузочный носитель?

source: **So you want to try Ubuntu MATE from a USB drive or SD card?** Great! If you're new to the process, you might be wondering why you just can't copy the Ubuntu MATE image on to your media and be good to go. To run an operating system, you need to write the image to the drive in a way that allows your computer to boot from it.
ru: **Вы ведь захотели попробовать Ubuntu MATE с USB диска или SD карты?** Прекрасно! Если вы незнакомы с этим процессом, то вы можете подумать, что для этого будет достаточно простого копирования загруженного образа Ubuntu MATE на ваш носитель данных и после этого им можно воспользоваться. Но на самом деле для запуска операционной системы с носителя вы должны записать его образ специальным способом, чтобы обеспечить загрузку компьютера с него.

source: To install and try Ubuntu MATE from a USB drive or SD card, you'll need media with at least 4 GB of memory and have [downloaded a compatible copy of Ubuntu MATE](/faq/downloads/) for your system.
ru: Для того чтобы установить или попробовать Ubuntu MATE с диска USB или SD карты, вам необходим носитель объемом не менее 4 Гб и [загруженная копия Ubuntu MATE](/faq/downloads/), совместимая с вашей системой.

source: ## Instructions
ru: ## Инструкции

source: This applies to both USB and microSD cards.
ru: Подходят для использования USB и карты microSD.

source: If the downloaded file has a `.xz` extension, use [7-Zip](http://www.7-zip.org/) to extract the `.img` file first.
ru: Если вы загрузили файл с расширением `.xz`, то воспользуйтесь программой [7-Zip](http://www.7-zip.org/) для извлечения файла `.img` сначала.

source: 1. Download the latest version of [balenaEtcher](https://www.balena.io/etcher/). Double-click on the downloaded file to install.
ru: 1. Загрузите новейшую версию программы [balenaEtcher](https://www.balena.io/etcher/). Выполните двойной щелчок по загруженному файлу для установки.

source: 2. Run the **balenaEtcher** application.
ru: 2. Запустите программу **balenaEtcher**.

source: 3. Click on the **Select Image** button and choose the Ubuntu MATE `.iso` file you want to use.
ru: 3. Нажмите кнопку **Select Image** и выберите файл Ubuntu MATE `.iso`, который вы собираетесь использовать.

source: ![Screenshot of Etcher](/images/faq/bootable/Etcher-Select-Image.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/Etcher-Select-Image.png)

source: 4. Click the **Select Target** button and choose the appropriate USB device to write the .iso to.
ru: 4. Нажмите кнопку **Select Target** и выберите соответствующее устройство USB для записи .iso на него.

source: ![Screenshot of Etcher](/images/faq/bootable/Etcher-Select-target.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/Etcher-Select-target.png)

source: 5. Finally, click the **Flash!** button to begin the process.
ru: 5. Наконец, нажмите кнопку **Flash!** для запуска процесса.

source: ![Screenshot of Etcher](/images/faq/bootable/Etcher-Flash.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/Etcher-Flash.png)

source: * It will show a progress bar as it operates.
ru: * При этом в процессе будет отображаться индикатор прогресса.

source: ![Screenshot of Etcher](/images/faq/bootable/Etcher-running.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/Etcher-running.png)

source: * Etcher will notify you when the process is complete.
ru: * Программа Etcher сообщит о завершении процесса.

source: ![Screenshot of Etcher](/images/faq/bootable/Etcher-complete.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/Etcher-complete.png)

source: * Please remove the USB drive and plug it into the system where you want to install Ubuntu MATE.
ru: * Пожалуйста, отключите USB накопитель и подключите его к системе, на которую вы собираетесь установить Ubuntu MATE.

source: If you plan on writing *and* using your bootable USB on Mac hardware, you'll need to erase and reformat your memory stick using Apple's *Disk Utility*, which you can launch from **Applications > Utilities** or the search function.
ru: Если вы собираетесь записывать *и* использовать USB накопитель на устройстве Mac, то вам следует стереть и переформатировать накопитель с использованием *Дисковой утилиты* от Apple, которую вы можете запустить из меню **Приложения > Утилиты** или воспользовавшись поиском.

source: 1. After launching *Disk Utility*, insert your USB stick, which will then appear. * If it does not, check **View > Show All Devices** from the menu bar. 1. Select the USB stick, and select `Erase` from the tool bar or right-click menu. 1. Select the `MS-DOS (FAT)` format and `GUID Partition Map` from the respective drop-down menus. 1. Check (and double check - you **can lose data if you select the wrong device or partition**) that you've chosen the target USB stick and click `Erase`.
ru: 1. После запуска *Дисковой утилиты*, подключите ваш USB накопитель, после этого он появится в программе. * Если он не появился, то выберите **Вид > Показать все устройства** на панели меню. 1. Выберите USB накопитель и нажмите `Стереть` на панели инструментов или в контекстном меню правой кнопки мыши. 1. Выберите формат `MS-DOS (FAT)` и `GUID Partition Map` из соответствующих выпадающих меню. 1. Проверьте (и перепроверьте **во избежании потери данных на неправильно выбранном устройстве или разделе**), что вы выбрали правильный накопитель и нажмите `Стереть`.

source: ![Screenshot of Disk Utility](/images/faq/bootable/disk-utility.png)
ru: ![Экранный снимок Дисковой утилиты](/images/faq/bootable/disk-utility.png)

source: 1. Download and install [Etcher](https://www.balena.io/etcher/), an open source project that flashes ISOs to SD cards and USB drives. 1. If necessary, open the 'Security and Privacy' section in System Preferences and allow apps downloaded from 'App Store and identified developers.' If this still does not allow you to run Etcher, click 'Open Anyway.'
ru: 1. Загрузите и установите программу [Etcher](https://www.balena.io/etcher/), проекта с открытым исходным кодом для записи файлов ISO на SD карты и USB накопители. 1. Если потребуется, откройте секцию 'Защита и безопасность' в Системных настройках и разрешите запуск приложений, загруженных из 'App Store и установленных разработчиков'. Если это не помогает запустить Etcher, то нажмите 'Все равно открыть'.

source: ![Screenshot of Etcher](/images/faq/bootable/open-etcher.png)
ru: ![Экранный снимок Etcher](/images/faq/bootable/open-etcher.png)

source: 1. Select the previously downloaded Ubuntu MATE ISO (which, by default, is in your Downloads folder) using **Select Image**. 1. Confirm **Select Target** is pointing to the intended USB drive, and if not, choose the appropriate device. 1. Click **Flash!** to write the ISO to your USB drive. Etcher will prompt you for your password. Etcher will display its progress, and inform you when the process has successfully completed with the image below. 1. If macOS informs you 'The disk you inserted is not readable by this computer,' select **Eject**, not **Initialise**
ru: 1. Выберите предварительно загруженный файл Ubuntu MATE ISO (который, по умолчанию, расположен в вашей папке Загрузки) используя кнопку **Select Image**. 1. Убедитесь что **Select Target** указывает на правильный накопитель USB, а если нет, то выберите нужное устройство. 1. Нажмите кнопку **Flash!** для записи ISO файла на USB накопитель. Etcher запросит ваш пароль, затем будет отображать прогресс и проинформирует вас об успешном завершении процесса. 1. Если macOS выводит сообщение 'Вставленный диск не читается на этом компьютере', то нажмите **Eject**, но не **Initialise**.

source: ![Screenshot of Mac's unreadable disk message](/images/faq/bootable/disk-not-readable.png)
ru: ![Экранный снимок сообщения Mac о нечитаемом диске](/images/faq/bootable/disk-not-readable.png)

source: 1. To use your bootable media on a Mac device, insert the USB stick and restart or turn on the device while holding the option/alt key to launch Startup Manager. Click on the gold disk labeled 'EFI Boot,' which will bring you to the Ubuntu boot menu.
ru: 1. Для использования загрузочного носителя на устройстве Mac, подключите USB накопитель и перезагрузите или включите устройство удерживая кнопку <kbd>Option</kbd>/<kbd>Alt</kbd> для запуска Startup Manager. Выберите золотой диск с надписью 'EFI Boot', после чего должно появиться меню запуска Ubuntu.

source: If you cannot boot from the USB drive on your Mac, try [burning a DVD](https://ubuntu.com/tutorials/tutorial-burn-a-dvd-on-windows).
ru: Если у вас не получается загрузить ваш Mac с USB накопителя, то [попробуйте записать DVD](https://ubuntu.com/tutorials/tutorial-burn-a-dvd-on-windows).

source: There are several apps and utilities for writing an ISO to a USB drive or a microSDHC in GNU/Linux, but we prefer `ddrescue` (from the [gddrescue](apt://gddrescue) package).
ru: В GNU/Linux существует несколько программ и утилит для записи ISO на USB накопитель или microSDHC, но мы предпочитаем использовать `ddrescue` (из пакета [gddrescue](apt://gddrescue)).

source: The image can be directly written to a microSDHC or to a USB drive using an utility like `dd`, but we prefer `ddrescue` (from the [gddrescue](apt://gddrescue) package).
ru: Файл образа может быть напрямую записан на microSDHC или USB накопитель с использованием утилиты `dd`, но мы предпочитаем использовать `ddrescue` (из пакета [gddrescue](apt://gddrescue)).

source: On a Debian-based system, like Ubuntu MATE, run:
ru: Для систем, основанных на Debian, например, Ubuntu MATE, выполните:

source: To find the block device name of your USB or microSDHC device, to see all your connected devices:
ru: Чтобы найти имя подключенного блочного устройства USB или microSDHC используйте команду:

source: For example, in the image below, the USB drive is `/dev/sdb1/`. Checking the name of your device is a key step, as **writing to the wrong device might corrupt or destroy your data**.
ru: Например, на изображении ниже, USB накопитель называется `/dev/sdb`. Проверка имени устройства является ключевым моментом, поскольку **запись на неправильное устройство может повредить или уничтожить ваши данные**.

source: ![Screenshot of fdisk command in terminal](/images/faq/bootable/fdisk-l.png)
ru: ![Экранный снимок команды fdisk в терминале](/images/faq/bootable/fdisk-l.png)

source: Once you've confirmed you have the correct block device, enter the following command replacing `path/to/iso` and `sdx` with the path to the iso file and block device name of your USB drive or microSDHC.
ru: После того как вы подтвердили выбор правильного блочного устройства, введите команду, заменяя `path/to/iso` и `sdx` на пути к iso файлу и блочному устройству USB накопителя или microSDHC.

source: [GNOME Disks](apt://gnome-disk-utility) comes pre-installed on Ubuntu 16.04 and later. This is an easy way to create a bootable USB drive.
ru: Программа [GNOME Disks](apt://gnome-disk-utility) предустановлена в Ubuntu 16.04 и новее. Она предоставляет простой способ создания загрузочных USB накопителей.

source: If **Disks** is not present on your system, you can install it from the terminal:
ru: Если программа **Диски** не установлена в вашей системе, вы можете установить ее через терминал:

source: 1. Download your chosen Ubuntu MATE image, keep note of the location, and insert your USB drive. Be sure it's visible in File Manager/Caja. Remember this process will format your USB drive and **erase all existing data**, so be sure you've backed it up.
ru: 1. Загрузите выбранный образ Ubuntu MATE, запомните его каталог хранения, затем подключите USB накопитель. Убедитесь, что он виден в Файловом Менеджере/Caja. Учтите, что дальнейший процесс отформатирует USB накопитель и **сотрет все существующие на нем данные**, поэтому убедитесь в наличии их резервной копии.

source: 1. Right-click on the ISO file, and select "Open with Disk Image Writer."
ru: 1. Нажмите правой кнопкой мыши на файле ISO, и выберите "Открыть в Disk Image Writer."

source: ![Right clicking an ISO file](/images/faq/bootable/gnome_disks_right_click.png)
ru: ![Меню правой кнопки мыши для ISO файла](/images/faq/bootable/gnome_disks_right_click.png)

source: 1. Select your USB drive in the "Destination" drop-down menu.
ru: 1. Выберите ваш USB накопитель в меню "Назначение".

source: ![Screenshot of restore disk image prompt](/images/faq/bootable/gnome_disks_start_restoring.png)
ru: ![Экранный снимок окна восстановления образа диска](/images/faq/bootable/gnome_disks_start_restoring.png)

source: 1. Click "Start Restoring." When it asks if you're sure you want to write the disk image to the device, click "Restore."
ru: 1. Нажмите "Начать восстановление". При появлении запроса подтверждения записи образа на накопитель нажмите "Восстановить."

source: ![Screenshot of GNOME Disks confirming action](/images/faq/bootable/gnome_disks_are_you_sure.png)
ru: ![Экранный снимок GNOME Disks при подтверждении восстановления](/images/faq/bootable/gnome_disks_are_you_sure.png)

source: 1. You may be asked for your password for authentication. Enter it and click "Authenticate."
ru: 1. Может появится запрос вашего пароля. Введите его и нажмите "Аутентификация".

source: 1. GNOME Disks will begin writing the image, showing its progress and an estimated time.
ru: 1. GNOME Disks начнет процесс записи образа с отображением его прогресса и оценки необходимого времени.

source: ![Screenshot of GNOME Disks writing data](/images/faq/bootable/gnome_disks_in_progress.png)
ru: ![Экранный снимок GNOME Disks при записи данных](/images/faq/bootable/gnome_disks_in_progress.png)

source: When complete, eject (or power off) the disk before removing.
ru: После окончания извлеките (или выключите) диск перед его отключением от компьютера.
