Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/faq-burn-disc.po
Languages: ru

source: title: Verifying Downloads
ru: title: Запись DVD диска

source: ## Burning to DVD
ru: ## Запись DVD диска

source: If your computer has a DVD burner and blank DVD-R/RW/+R/+RW media, here's how you can make your own Ubuntu MATE installation disc and live session for your desktop or laptop.
ru: Если у вашего компьютера есть устройство записи DVD и у вас есть пустой диск DVD-R/RW/+R/+RW, то вы можете воспользоваться инструкцией ниже для записи Ubuntu MATE на диск для использования его в качестве установочного носителя или запуска "живой" сессии с него на вашем компьютере или ноутбуке.

source: Windows 7 (and later) supports the ability to burn straight from the desktop. Right click the file and choose **Burn image**.
ru: Windows 7 (и новее) предоставляет возможность записи файлов образов напрямую с рабочего стола. Нажмите правой кнопкой мыши на файле и выберите **Записать образ**.

source: ![Right clicking an ISO file in Windows](/images/faq/dvd/win.png)
ru: ![Меню правой кнопки мыши для файла ISO в Windows](/images/faq/dvd/win.png)

source: If you need to use an older computer running Windows Vista or earlier, consider [InfraRecorder](http://infrarecorder.org/?page_id=5), a free and open-source image-burning program.
ru: Если вам приходится использовать более старый компьютер с Windows Vista или старше, то вы можете использовать бесплатную программу с открытым исходным кодом [InfraRecorder](http://infrarecorder.org/?page_id=5) для записи файла образа.

source: macOS supports the ability to burn using **Disk Utility**. Right click the file and choose **Burn image**.
ru: macOS предоставляет возможность записи образов с использованием **Дисковой утилиты**. Нажмите правой кнопкой мыши на файле и выберите **Записать образ**.

source: ![Right clicking an ISO file on Mac](/images/faq/dvd/macOS.png)
ru: ![Меню правой кнопки мыши для файла ISO на Mac](/images/faq/dvd/macOS.png)

source: Your distribution may or may not provide disc burning tools as many believe it is an uncommon necessity these days. If you don't have one installed, here's a couple you may try:
ru: Ваш дистрибутив может предлагать или не предлагать программу для записи дисков, поскольку многие считают, что это не популярно в настоящее время. Если у вас такая программа не установлена, то вот пара программ, которые можно попробовать:

source: Use your distribution's software manager to install these. Both are free and open source software.
ru: Используйте систему управления программами вашего дистрибутива для их установки. Обе программы бесплатные и имеют открытый исходный код.

source: Right click the file and open the ISO file in the disc burning utility.
ru: Нажмите правой кнопкой мыши на файле ISO для его открытия в программе записи дисков.

source: ![Right clicking an ISO file in Ubuntu MATE](/images/faq/dvd/ubuntumate.png)
ru: ![Меню правой кнопки мыши для файла ISO в Ubuntu MATE](/images/faq/dvd/ubuntumate.png)
