Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/funding.po
Languages: ru

source: title: Funding
ru: title: Финансирование

source: This crowd funding campaign has the following objectives:
ru: Эта краудфандинговая кампания преследует следующие цели:

source: * Fund the costs associated with running the Ubuntu MATE and MATE Desktop projects. * These include domain name registrations and service charges for things like the content delivery network, web application firewall and transactional email services used by the forums. * Fund the development of Ubuntu MATE and MATE Desktop via financial rewards for contributors to either project. * Help subsidise the travel expenses of team members to represent Ubuntu MATE and MATE Desktop at FLOSS conferences. * Support other Open Source projects that Ubuntu MATE depends upon.
ru: * Финансирование расходов, связанных с запуском проектов Ubuntu MATE и MATE Desktop.. * К ним относятся регистрация доменного имени и плата за обслуживание таких вещей, как сеть доставки контента, брандмауэр веб-приложений и услуги транзакционной электронной почты, используемые на форумах. * Финансирование разработки Ubuntu MATE и MATE Desktop посредством финансовых вознаграждений для участников обоих проектов. * Субсидирование командировочных расходов членов команды для представления Ubuntu MATE и MATE Desktop на конференциях FLOSS. * Поддержка других проектов с открытым исходным кодом, от которых зависит Ubuntu MATE.

source: We have set up a number of payment options that should hopefully suit everyone. Go on, be brilliant, help grow our community.
ru: Мы создали ряд способов оплаты, которые, надеемся, устроят всех. Проявите великодушие, помогите развитию нашего сообщества.

source: This is a unique way to fund an Open Source community. A regular monthly income for the Ubuntu MATE project will allow us to better plan how best to reward our contributors and sponsor other Open Source projects.
ru: Это уникальный способ финансировать сообщество с открытым исходным кодом. Регулярный ежемесячный доход для проекта Ubuntu MATE позволит нам лучше планировать, как лучше всего вознаграждать наших участников и спонсировать другие проекты с открытым исходным кодом

source: **Patrons get exclusive project exclusive project news, updates, are invited to join an exclusive Telegram channel where you can talk to the developers directly and get a badge in the [Ubuntu MATE Community](https://ubuntu-mate.community).**
ru: **Покровители получают эксклюзивные новости проекта, обновления, могут присоединиться к эксклюзивному каналу Telegram, где могут напрямую пообщаться с разработчиками и получить значок в [сообществе Ubuntu MATE](https://ubuntu-mate.community).**

source: title = "Monthly supporter" text = "Become a monthly supporter via Patreon and help grow the Ubuntu MATE community." button_text = "Become a Patron" button_url = "https://www.patreon.com/ubuntu_mate"
ru: title = "Ежемесячная поддержка" text = "Станьте ежемесячным спонсором через Patreon и помогите расширить сообщество Ubuntu MATE." button_text = "Стать покровителем на Patreon" button_url = "https://www.patreon.com/ubuntu_mate"

source: {:.center} ![PayPal logo](/images/brands/paypal.svg)
ru: {:.center} ![логотип PayPal](/images/brands/paypal.svg)

source: We'd prefer you set-up a recurring payment to help ensure that monthly costs are always covered and it also allows us to better plan how to reward our contributors and sponsor other Open Source projects. That said, one time donations are also gratefully accepted.
ru: Мы бы предпочли, чтобы вы установили периодический платеж, чтобы гарантировать, что ежемесячные расходы всегда покрываются, а также это позволяет нам лучше планировать, как вознаграждать наших участников и спонсировать другие проекты с открытым исходным кодом. При этом с благодарностью принимаются и разовые пожертвования.

source: **NOTE! If you are considering a monthly recurring payment via PayPal then you should probably use the [Ubuntu MATE Patreon](https://www.patreon.com/ubuntu_mate) to benefit from Patron rewards.**
ru: **Примечание. Если вы планируете ежемесячный регулярный платеж через PayPal, вам, вероятно, следует использовать [Ubuntu MATE Patreon](https://www.patreon.com/ubuntu_mate), чтобы получить вознаграждение для покровителей.**

source: # Commercial sponsorship
ru: # Коммерческое спонсорство

source: If you are using, or plan to use, Ubuntu MATE in a commercial environment and would like to sponsor the project more formally, then please head over to our Patreon page where we have commercial sponsorship packages.
ru: Если вы используете или планируете использовать Ubuntu MATE в коммерческой среде и хотели бы спонсировать проект более формально, перейдите на нашу страницу Patreon, где у нас есть коммерческие спонсорские пакеты.

source: title = "Commercial Sponsor" text = "Become a commercial sponsor at Patreon and have your business prominently listed as a sponsor." button_text = "Become a commercial sponsor" button_url = "https://www.patreon.com/ubuntu_mate"
ru: title = "Коммерческий спонсор" text = "Станьте коммерческим спонсором на Patreon и ваша компания станет видна в списке спонсоров." button_text = "Стать коммерческим спонсором" button_url = "https://www.patreon.com/ubuntu_mate"

source: Click or scan the QR code below to launch your Bitcoin client and donate 0.005 btc to Ubuntu MATE. Alternatively, copy and paste the Bitcoin address into your Bitcoin client to donate an amount of your choice.
ru: Нажмите на или отсканируйте QR-код ниже для запуска клиента Bitcoin и перевода 0.005 BTC для Ubuntu MATE. Или скопируйте и вставьте адрес Bitcoin в ваш Bitcoin клиент для перевода выбранной вами суммы.

source: ## Affiliate Links
ru: ## Партнерские ссылки

source: Some pages on this website include Amazon affiliate links to products we've tested and are known to be compatible with Ubuntu MATE. Clicking those links will earn us a commission, with no additional cost to you, in the event of purchases.
ru: На некоторых страницах этого веб-сайта есть партнерские ссылки Amazon на продукты, которые мы тестировали и которые, как известно, совместимы с Ubuntu MATE. Переходы по этим ссылкам, позволяют нам получать комиссию без каких-либо дополнительных затрат с вашей стороны в случае совершения покупок.
