Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-bug-triage.po
Languages: ru

source: title: Bug Reporting and Triage
ru: title: Сообщение об ошибках и сортировка

source: ## Bug Reporting
ru: ## Сообщение об ошибке

source: ### First Steps
ru: ### Первые шаги

source: If you don't already have a Launchpad account, [set one up](https://help.launchpad.net/YourAccount/NewAccount) before you get started. Ubuntu uses Launchpad to track bugs and their fixes.
ru: Если у вас еще нет учетной записи на Launchpad, [создайте ее](https://help.launchpad.net/YourAccount/NewAccount) перед тем как начать. Ubuntu использует Launchpad для отслеживания ошибок и их исправления.

source: ### Is Your Bug a Bug
ru: ### Является ли ваша ошибка ошибкой

source: No, this isn't a weird philosophical question. Be sure to check the [community forum](https://ubuntu-mate.community) to see if your bug might just be a configuration issue. Make sure you also check the [release notes](/blog/) for your particular version of Ubuntu MATE, and also check [Launchpad](https://bugs.launchpad.net/ubuntu-mate) for any duplicate reports of your issue.
ru: Нет, это не вопрос из области философии. В первую очередь посетите [форум сообщества](https://ubuntu-mate.community) чтобы понять является ли ваша ошибка всего лишь проблемой конфигурирования. Также ознакомьтесь с [примечания к выпуску](/blog/) для вашей конкретной версии Ubuntu MATE и поищите дублирующие сообщения об ошибках на [Launchpad](https://bugs.launchpad.net/ubuntu-mate).

source: ### Reporting Bugs in Ubuntu MATE
ru: ### Сообщения об ошибках в Ubuntu MATE

source: If your issue is indeed a bug, [this tutorial](https://ubuntu-mate.community/t/how-to-report-problems-in-ubuntu-mate/17943) is extremely helpful in showing the individual steps to file a report. Many thanks to APolihron, one of our QA testers, for making this!
ru: Если ваша проблема действительно является ошибкой, то [это руководство](https://ubuntu-mate.community/t/how-to-report-problems-in-ubuntu-mate/17943) будет чрезвычайно полезно для демонстрации отдельных шагов формированию отчета об ошибке. Большое спасибо APolihron, одному из наших тестировщиков QA, за это!

source: ## Bug Triage
ru: ## Сортировка ошибок

source: Once bug reports are filed, the next step is to triage the bug. Much like medical staff prioritize patients based on the severity of their condition, bug triagers help teams determine which bugs are critical, and which are less urgent.
ru: После отправки отчетов об ошибках следующим шагом будет сортировка ошибки. Подобно тому, как медицинский персонал расставляет приоритеты для пациентов в зависимости от тяжести их состояния, сортировщики ошибок помогают командам определить, какие ошибки являются критическими, а какие менее важными.

source: Some bug triage tasks require special privileges granted by project owners or administrators, but others simply require a [Launchpad](https://code.launchpad.net/ubuntu/+login) account. The key things you can do to help us prioritise bugs are as follows:
ru: Для некоторых задач по сортировке ошибок требуются особые привилегии, предоставленные владельцами или администраторами проектов, для других просто требуется учетная запись [Launchpad](https://code.launchpad.net/ubuntu/+login). Ключевые вещи, которые вы можете сделать, чтобы помочь нам определить приоритетность ошибок, заключаются в следующем:

source: * Can you reproduce a reported bug? If you can, write up the steps you followed to confirm the issue also exists for you. * If you confirmed the bug, could you also replicate the issue in stock Ubuntu or other flavours? Be sure your report indicates other affected flavours, or if the issue was limited to Ubuntu MATE. * However, if you can't reproduce the bug, can you get more information from the original bug reporter? * Did you determine the bug was a duplicate? If so, mark one bug as a duplicate of the other. * Did you determine the bug was filed with the wrong project? If so, re-open the bug with the right project and leave a note in the initial location.
ru: * Можете ли вы воспроизвести обнаруженную ошибку? Если можете, запишите шаги, которые вы выполнили, чтобы убедиться, что проблема существует и для вас.. * Если вы подтвердили ошибку, не могли бы вы также воспроизвести проблему в стандартной версии Ubuntu или других редакциях? Убедитесь, что в вашем отчете указаны другие затронутые редакции, или указано, что проблема была ограничена Ubuntu MATE. * В случае если вы не можете воспроизвести ошибку, то постарайтесь получить дополнительную информацию от пользователя, создавшего это сообщение об ошибке. * Можете ли вы определить эту ошибку в качестве дубликата? Если можете, что отметьте одну ошибку как дубликат другой. * Можете ли вы определить, что сообщение об ошибке создано относительно неверно выбранного проекта? Если да, то отметьте правильный проект и напишите комментарий с названием исходно выбранного проекта.

source: The initial work can help us realise where an error is, especially if the error is upstream. Bug triagers help make sure things are flowing as they should between upstream and downstream, and help bug fixers know where they need to focus their efforts.
ru: Первоначальная работа может помочь нам понять, где находится ошибка, особенно если ошибка в восходящим потоком (upstream). Сортировщики ошибок помогают убедиться, что все происходит должным образом между восходящим и нисходящим (downstream, дистрибутивом) потоками, а также помогают специалистам по исправлению ошибок узнать, на чем им нужно сосредоточить свои усилия.

source: The video below shows bug triaging (and Martin!) in action:
ru: Видео ниже демонстрирует процесс (и Мартина!) сортировки ошибок:
