Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-spread-word.po
Languages: ru

source: title: Spread the Word
ru: title: Распространение информации

source: ## Spread the Word
ru: ## Распространение информации

source: We hope you love Ubuntu MATE as much as we do! If you do, we'd love for you to share that excitement with others. Be creative! Put more green in your wardrobe. When someone asks if you like coffee or tea, mention how you prefer MATE or Ubuntu MATE. Here's a few other ideas.
ru: Мы надеемся, что вы любите Ubuntu MATE так же сильно, как и мы! Если это искренне, то мы будем рады, если вы разделите это чувство с другими. Будьте креативны! Добавьте больше зеленого в свой гардероб. А когда кто-то спросит, любите ли вы кофе или чай, укажите, что вы предпочитаете MATE или Ubuntu MATE. Это лишь несколько идей.

source: ### Social Media
ru: ### Социальные сети

source: This is definitely the easiest way to introduce your family, friends, and random followers to Ubuntu MATE. Share a post from our [blog](/blog/). Follow us at **[@ubuntumate](https://twitter.com/ubuntu_mate)** and let our informative, GIF-filled posts inspire you to hit the 'Like' (and maybe even the 'Retweet') button.
ru: Это определенно самый простой способ познакомить вашу семью, друзей и случайных подписчиков с Ubuntu MATE. Поделитесь публикацией из нашего [блога](/blog/). Подпишитесь на нас в Твиттере **[@ubuntumate](https://twitter.com/ubuntu_mate)** и пусть наши информативные сообщения, наполненные GIF-иллюстрациями, вдохновят вас нажать кнопку 'Нравится' (и, возможно, даже кнопку 'Ретвитнуть').

source: Talk about Ubuntu MATE on your favorite IRC, Mastodon, and Telegram groups, or your favorite Linux forum. Post an influencer-worthy pic of your home office on Instagram, and use a filter to make that green login screen pop. Make a Tik-Tok video so we all become Internet-famous.
ru: Вы можете пообщаться на тему Ubuntu MATE в ваших любимых IRC, группах Mastodon и Telegram, или на Linux форуме. Опубликуйте в Instagram фото вашего домашнего офиса, достойное внимания, и воспользуйтесь фильтром, чтобы зеленый экран входа в систему выделялся. Сделайте видео в Tik-Tok, чтобы мы все стали известными в Интернете.

source: ### Merchandise
ru: ### Продукция

source: Sometimes, spreading the word doesn't take any words at all! A stylish Ubuntu MATE polo, T-shirt, or hoodie can tell your friends, family, and coworkers you're smart in your fashion AND Linux distro choices. Your morning cup of caffeine can get you through your day and help spark a conversation. Find all these goodies at our [shop](/shop/).
ru: Иногда для распространения слова вообще не нужны слова! Стильная футболка-поло, футболка или худи Ubuntu MATE расскажет вашим друзьям, семье и коллегам, что вы разбираетесь в моде И выборе дистрибутива Linux. Утренняя чашка кофеина поможет вам в течение дня и поможет зажечь разговор. Все эти вкусности можно найти в нашем [магазине](/shop/).

source: ### Reviews
ru: ### Обзоры

source: Finally, one of the most useful ways of introducing people to Ubuntu MATE are through members of the Linux community who give helpful and honest reviews of Ubuntu MATE's strengths and weaknesses. We're fortunate to have a strong reviewing community, and you can see some of these reviews on our [Testimonials](/about/testimonials/) page. Community feedback has always helped us improve Ubuntu MATE, and we're excited to hear from new voices with new insights.
ru: Наконец, один из самых полезных способов познакомить людей с Ubuntu MATE - через членов сообщества Linux, которые делают полезные и честные обзоры сильных и слабых сторон Ubuntu MATE. Нам повезло, что у нас сильное сообщество рецензентов, и вы можете увидеть некоторые из этих обзоров на нашей странице [Отзывы](/about/testimonials/). Отзывы сообщества всегда помогали нам улучшать Ubuntu MATE, и мы рады слышать новые голоса с новыми идеями.
