Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-translations.po
Languages: ru

source: title: Translations
ru: title: Переводы

source: ## Translations
ru: ## Переводы

source: If you speak another language, translating is a perfect way to help your fellow speakers use the computer in a language more familiar to them. Contributions even help the wider Ubuntu and Linux communities at large as applications are shared between them.
ru: Если вы говорите на нескольких языках, то перевод - отличный способ помочь вашим коллегам использовать компьютер на наиболее знакомом им языке. Выполнение переводов также помогает более широкому сообществу Ubuntu и Linux в целом, поскольку приложения являются общими для них.

source: > The translators are our real heroes. > > -- Martin Wimpress
ru: > Переводчики - наши настоящие герои. > > -- Мартин Вимпресс

source: Applications specific to the Ubuntu MATE experience. For this website and our in-house applications, we use Transifex.
ru: Приложения, специфичные для Ubuntu MATE. Для этого веб-сайта и наших собственных приложений мы используем Transifex.

source: The **Welcome** application suffers from a 'split strings' issue that may pose difficulties when translating in other languages. We apologise for the inconvenience and intend to refactor the application in a future release to address this issue.
ru: Приложение **Добро пожаловать** (**Welcome**) имеет проблему 'разделенных строк', которая может создать трудности при переводе на другие языки. Приносим извинения за неудобства и намерены провести переработку приложения в следующем выпуске, чтобы решить эту проблему.

source: Note that **Software Boutique** is currently part of the **Welcome** application.
ru: Пожалуйста, учтите что **Магазин программного обеспечения** (**Software Boutique**) теперь является частью приложения **Добро пожаловать** (**Welcome**).

source: [Translate on Transifex](https://www.transifex.com/ubuntu-mate/public/){:.btn .green} [Transifex Guide](#transifex){:.btn}
ru: [Перевести на Transifex](https://www.transifex.com/ubuntu-mate/public/){:.btn .green} [Руководство по Transifex](#transifex){:.btn}

source: ### MATE Desktop
ru: ### Рабочий стол MATE

source: The MATE Desktop team use Transifex for translations. This includes applications such as:
ru: Команда рабочего стола MATE использует Transifex для перевода таких приложений как:

source: * Atril Document Viewer * Caja File Manager * Engrampa Archive Manager * Eye of MATE Image Viewer * MATE Calculator * MATE Control Centre * MATE System Monitor * MATE Terminal * Pluma Text Editor
ru: * Просмотрщик документов Atril * Файловый менеджер Caja * Менеджер архивов Engrampa * Программа просмотра изображений MATE * Калькулятор MATE * Центр управления MATE * Системный монитор MATE * Терминал MATE * Текстовый редактор Pluma

source: As well as system configuration and panel applets.
ru: А также конфигурация системы и апплеты панели.

source: [Translate on Transifex](https://www.transifex.com/projects/p/MATE/){:.btn .green} [Transifex Guide](#transifex){:.btn}
ru: [Перевести на Transifex](https://www.transifex.com/projects/p/MATE/){:.btn .green} [Руководство по Transifex](#transifex){:.btn}

source: ### Default Apps
ru: ### Предустановленные приложения

source: Below is a list of applications that are pre-installed and where you can translate them.
ru: Ниже представлен список предустановленных приложений, и ссылки на ресурсы для их перевода.

source: ## Translation Guide
ru: ## Руководство по переводу

source: Launchpad is used throughout Ubuntu for building and maintaining software. To translate, you'll need a Launchpad account. Please [see the documentation for translating](https://help.launchpad.net/Translations).
ru: Launchpad широко используется в Ubuntu для создания и поддержки программного обеспечения. Для перевода вам понадобится учетная запись Launchpad. Пожалуйста, [изучите документацию по переводу](https://help.launchpad.net/Translations).

source: 1. Register for a free account at <https://www.transifex.com/signup/>
ru: 1. Зарегистрируйте бесплатную учетную запись на <https://www.transifex.com/signup/>

source: ![Sign up button](/images/get-involved/translations/transifex-1.png)
ru: ![Кнопка регистрации](/images/get-involved/translations/transifex-1.png)

source: 1. Open the project page to find the application you'd like to translate.
ru: 1. Откройте страницу проекта, чтобы найти приложение, которое вы хотите перевести.

source: ![Project Page](/images/get-involved/translations/transifex-2.png)
ru: ![Страница проекта](/images/get-involved/translations/transifex-2.png)

source: 1. Choose the language team you'd like to join.
ru: 1. Выберите языковую команду, к которой хотите присоединиться.

source: ![Choosing a language](/images/get-involved/translations/transifex-3.png)
ru: ![Выбор языка](/images/get-involved/translations/transifex-3.png)

source: If the language is not listed, you can request it. Check back in a few days as this requires approval.
ru: Если языка нет в списке, вы можете запросить его. Повторите попытку через несколько дней, так как это требует одобрения.

source: ![Request language in a dropdown menu](/images/get-involved/translations/transifex-4.png)
ru: ![Запрос языка в выпадающем меню](/images/get-involved/translations/transifex-4.png)

source: 1. Pick the language you'd like to translate.
ru: 1. Выберите язык, на который хотите перевести.

source: ![Picking a language from the list](/images/get-involved/translations/transifex-5.png)
ru: ![Выбор языка из списка](/images/get-involved/translations/transifex-5.png)

source: 1. Pick a resource from the list to translate.
ru: 1. Выберите ресурс из списка для перевода.

source: ![Picking a language from the list](/images/get-involved/translations/transifex-6.png)
ru: ![Выбор ресурса для перевода](/images/get-involved/translations/transifex-6.png)

source: 1. Click on the entry, a pop up will appear, click Translate.
ru: 1. Нажмите на запись, появится всплывающее окно, нажмите Перевести.

source: ![Pop up after choosing a resource](/images/get-involved/translations/transifex-7.png)
ru: ![Всплывающее окно после выбора ресурса](/images/get-involved/translations/transifex-7.png)

source: 1. Begin translating!
ru: 1. Начните переводить!

source: ![Screenshot of main translation interface](/images/get-involved/translations/transifex-8.png)
ru: ![Экранный снимок основного окна переводов](/images/get-involved/translations/transifex-8.png)

source: * Don't forget to save your changes.
ru: * Не забудьте сохранить ваши изменения.

source: ![Save all button](/images/get-involved/translations/transifex-9.png)
ru: ![Кнопка сохранить все](/images/get-involved/translations/transifex-9.png)
