Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-crowdfund.po
Languages: ru

source: title: Crowd Funding
ru: title: Краудфандинг

source: ## Crowd Funding
ru: ## Краудфандинг

source: Did you know one of the most important contributions you can make to Ubuntu MATE doesn't require a single line of code? Like many open source projects, community financial support not only helps keep the virtual lights on, but funds improvements to Ubuntu MATE, the MATE Desktop, and numerous other Open Source projects.
ru: Знаете ли вы, что для одного из самых важных вкладов в Ubuntu MATE не требуется ни единой строчки кода? Как и во многих проектах с открытым исходным кодом, финансовая поддержка сообщества не только помогает поддерживать виртуальный свет, но и финансирует улучшения Ubuntu MATE, MATE Desktop и множества других проектов с открытым исходным кодом.

source: Between 2014 and 2017, your generosity helped pay for:
ru: Между 2014 и 2017 годами платежи помогли развитию:

source: * Welcome and Software Boutique * Ambiant and Radiant Themes * Brisk Menu * Accessibility fixes and improvements
ru: * Приложение Добро пожаловать и магазин программного обеспечения (Welcome и Software Boutique) * Темы Ambiant и Radiant * Меню Brisk * Улучшения и исправления для вспомогательных технологий

source: ### MATE Desktop
ru: ### Рабочий стол MATE

source: * Reviewing and sponsoring uploads to Debian * Development and packaging in Debian * GTK3 migrating and porting * MATE Menu * MATE Dock * [Engrampa](https://github.com/mate-desktop/engrampa) * Development and packaging for Fedora and Linux Mint
ru: * Рецензирование и поддержка публикации пакетов в Debian * Разработка и создание пакетов в Debian * Портирование и миграция на GTK3 * Меню MATE * Док MATE * [Менеджер архивов Engrampa](https://github.com/mate-desktop/engrampa) * Разработка и создание пакетов для Fedora и Linux Mint

source: ### Open Source Projects
ru: ### Проекты с открытым исходным кодом

source: ## Spreading the Word
ru: ## Распространение информации

source: * MicroSD cards and memory sticks flashed with Ubuntu MATE to distribute at Raspberry Pi Jams * Raspberry Pis, ODROIDs, and a secondhand iBook G4 for development of specific Ubuntu MATE images * Dedicated servers * Prizes for community competitors * Getting Wimpy to UbuCon Europe 2016 * A reasonably-priced beverage to celebrate the release of 15.10 :wine_glass:
ru: * Карты памяти MicroSD и флешки с записанным на них Ubuntu MATE для распространения на джемах Raspberry Pi * Приобретение плат Raspberry Pi, ODROID, и подержанных iBook G4 для разработки специальных вариантов образов Ubuntu MATE * Выделенные сервера * Призы для участников сообщества * Поездка Мартина Вимпресса на конференцию UbuCon Europe 2016 * Напитки по разумной цене в честь выпуска 15.10 :wine_glass:

source: To show how a small donation can go a long way, let's look at how we funded two Raspberry Pi 3's for development, costing £62.90 each. This breaks down to:
ru: Чтобы показать, как небольшое может иметь большое значение, давайте посмотрим, как мы профинансировали приобретение для разработки двух Raspberry Pi 3, стоящих каждая по £62.90. Это разбивается на:

source: * 32 donations of £2, or * 13 donations of £5, or * 7 donations of £10 _(all with a little change to spare)_
ru: * 32 пожертвования по £2, или * 13 пожертвований по £5, или * 7 пожертвований по £10 _(примерно, с учетом сдачи)_

source: In short, :relieved: + :dollar: :pound: :euro: :credit_card: = :green_heart:
ru: Другими словами, :relieved: + :dollar: :pound: :euro: :credit_card: = :green_heart:

source: So if you want to help grow our community and keep Ubuntu MATE amazing, head over to our funding page and find out how you can help!
ru: Поэтому, если вы хотите помочь развитию нашего сообщества и сохранить великолепный Ubuntu MATE, перейдите на нашу страницу финансирования и узнайте, чем вы можете помочь!

source: [View Funding Options](/funding/){:.btn .green}
ru: [Узнать о финансировании](/funding/){:.btn .green}
