Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-guidelines-design.po
Languages: ru

source: title: Design Guidelines
ru: title: Рекомендации по дизайну

source: ## Design Guidelines
ru: ## Рекомендации по дизайну

source: ### Ubuntu MATE Logo
ru: ### Логотип Ubuntu MATE

source: {:.center} ![Main Logo](/images/get-involved/logo-guidelines/Main_Logo.png)
ru: {:.center} ![Основной логотип](/images/get-involved/logo-guidelines/Main_Logo.png)

source: The Ubuntu MATE logo captures the precise and reliable qualities of the brand in a straightforward symbol and wordmark.
ru: Логотип Ubuntu MATE отражает точные и надежные качества бренда в простом символе и слове.

source: It is made up of a custom designed font (wordmark), carefully spaced with a re-drawn ‘Circle of MATEs’ placed within a roundel.
ru: Он состоит из специально разработанного шрифта (словесного знака), аккуратно перерисованного ‘Круга MATE’, помещенного в кружок.

source: Consistent use of the Ubuntu MATE logo is essential in creating a united brand identity. The master logo is supplied as artwork and should never be altered, distorted or re-created in any way.
ru: Правильное использование логотипа Ubuntu MATE необходимо для создания единого фирменного стиля. Главный логотип предоставляется в виде иллюстраций, и его нельзя каким-либо образом изменять, искажать или воссоздавать.

source: ### Logo Elements
ru: ### Элементы логотипа

source: {:.center} ![Logo Elements](/images/get-involved/logo-guidelines/Logo_elements.png)
ru: {:.center} ![Элементы логотипа](/images/get-involved/logo-guidelines/Logo_elements.png)

source: #### Wordmark
ru: #### Словесный знак

source: The logotype is created using the Ubuntu font. The word _MATE_ is uppercase and represents the desktop environment used: MATE Desktop.
ru: Логотип создан с использованием шрифта Ubuntu. Слово _MATE_ в верхнем регистре обозначает используемую среду рабочего стола: рабочий стол MATE.

source: #### Roundel
ru: #### Кружок

source: Circular shape containing the Circle of MATEs.
ru: Круглая форма, содержащая Круг MATE.

source: ### The Circle of MATEs
ru: ### Круг MATE

source: {:.center} ![Circle of MATEs](/images/get-involved/logo-guidelines/Circle_of_MATEs.png)
ru: {:.center} ![Круг MATE](/images/get-involved/logo-guidelines/Circle_of_MATEs.png)

source: The Circle of MATEs is the symbol that accompanies the wordmark in the Ubuntu MATE logo. The triangles inside the roundel represent the three fundamental elements of this project: the Ubuntu base, the MATE Desktop and the community. The circular lines represent the connection and the collaboration between these elements.
ru: Круг MATE - это символ, который сопровождает словесный знак в логотипе Ubuntu MATE. Треугольники внутри кружка представляют три основных элемента этого проекта: базу Ubuntu, рабочий стол MATE и сообщество. Круглые линии представляют связь между этими элементами.

source: ### Available colorways #### Wordmark
ru: ### Доступные цветовые решения #### Словесный знак

source: {:.center} ![Main Logo](/images/get-involved/logo-guidelines/Main_Logo.png) ![Main Logo White](/images/get-involved/logo-guidelines/Main_Logo_white.png)
ru: {:.center} ![Основной логотип](/images/get-involved/logo-guidelines/Main_Logo.png) ![Main Logo White](/images/get-involved/logo-guidelines/Main_Logo_white.png)

source: The wordmark logo is presented only with colours above. Please, never change any of the colours in the logo. The white logo has been placed on a green background for visibility purposes. The background is not part of the logo; you are free to place the logo on whatever background you want, so long as you are able to see it.
ru: Словесный логотип представлен только указанными выше цветами. Пожалуйста, никогда не меняйте цвета логотипа. Белый логотип размещен на зеленом фоне для наглядности. Фон не является частью логотипа; вы можете разместить логотип на любом фоне, при условии, что вы можете его видеть.

source: ### Roundel
ru: ### Кружок

source: {:.center .small} ![Circle of MATEs Green](/images/get-involved/logo-guidelines/Circle_of_MATEs_green.png) ![Circle of MATEs White](/images/get-involved/logo-guidelines/Circle_of_MATEs_white.png)
ru: {:.center .small} ![Зеленый Кружок MATE](/images/get-involved/logo-guidelines/Circle_of_MATEs_green.png) ![Circle of MATEs White](/images/get-involved/logo-guidelines/Circle_of_MATEs_white.png)

source: As with the wordmark, use the roundel logo only with the colour configurations above. The white version has been placed on a green background for visibility purposes. The background is not part of the logo; you are free to place the logo on whatever background you want, so long as you are able to see it.
ru: Как и в случае со словесным знаком, используйте логотип в виде кружка только с указанным выше цветовыми конфигурациями. Белая версия размещена на зеленом фоне для наглядности. Фон не является частью логотипа; вы можете разместить логотип на любом фоне, при условии, что вы можете его видеть.

source: ### Which logo should I use?
ru: ### Какой логотип использовать?

source: It makes no difference which logo you choose to use for your works. There isn't a _preferred_ version we like to see. Just select what you want so that the logo is well distinguishable. We recommend that you use the white versions of the logos on darker backgrounds, and that you use the coloured versions on lighter backgrounds.
ru: Не имеет значения, какой логотип вы выберете для своих работ. Нет _предпочтительной_ версии, которую мы хотели бы видеть. Просто выберите то, что вы хотите, чтобы логотип был хорошо различим. Мы рекомендуем вам использовать белые версии логотипов на более темном фоне и использовать цветные версии на более светлом фоне.

source: ### Exclusion Zone
ru: ### Охранная зона

source: The Ubuntu logo must always have a clear area surrounding it, free from any other element. To define this area, measure the height of the roundel and use half this measure to create the boundary of clear space around the logo.
ru: У логотипа Ubuntu всегда должно быть свободное пространство вокруг него, свободное от каких-либо других элементов. Чтобы определить эту область, измерьте высоту кружка и используйте половину этой меры, чтобы создать границу свободного пространства вокруг логотипа.

source: {:.center} ![Ubuntu MATE Logo Margins](/images/get-involved/logo-guidelines/Ubuntu-MATE-Tag-Green-and-Black-margins.png)
ru: {:.center} ![Границы логотипа Ubuntu MATE](/images/get-involved/logo-guidelines/Ubuntu-MATE-Tag-Green-and-Black-margins.png)

source: The Circle of MATEs, when used on its own, must always have a clear area surrounding it, free from any other element. To define this area, measure the height of the roundel and use a quarter of this measure to create the boundary of clear space.
ru: Круг МАТЕ, когда он используется сам по себе, всегда должен иметь вокруг чистую область, свободную от каких-либо других элементов. Чтобы определить эту область, измерьте высоту кружка и используйте четверть этой меры, чтобы создать границу свободного пространства.

source: {:.center} ![Ubuntu MATE Rondel Margins](/images/get-involved/logo-guidelines/Ubuntu-MATE-Rondel-Green-margins.png)
ru: {:.center} ![Границы Круга Ubuntu MATE](/images/get-involved/logo-guidelines/Ubuntu-MATE-Rondel-Green-margins.png)

source: ### Incorrect use
ru: ### Неправильное использование

source: By following the guidelines on how to use this artwork, you will help to build a powerful and united identity for the Ubuntu MATE brand. This section shows examples of incorrect use.
ru: Следуя инструкциям по использованию этого фирменного стиля, вы поможете создать мощную и единую идентичность бренда Ubuntu MATE. В этом разделе показаны примеры неправильного использования.

source: You must not:
ru: Вы не должны:

source: 1. Change the spacing between the individual elements or characters 2. Change the colour of the wordmark 3. Change the colour of the Circle of MATEs 4. Change the arrangement of the elements 5. Place the logo at an angle other than horizontal or vertical 6. Change the proportion of the logo
ru: 1. Изменять интервал между отдельными элементами или символами. 2. Изменять цвет словесного знака. 3. Изменять цвет круга MATE. 4. Изменять расположение элементов. 5. Размещать логотип под углом, отличным от горизонтального или вертикального. 6. Изменять пропорции логотипа.

source: ### Ubuntu MATE stacked logo
ru: ### Столбчатый логотип Ubuntu MATE

source: {:.center .small} ![Ubuntu MATE Stacked Logo](/images/get-involved/logo-guidelines/Wheel_tag_coloured.png) ![Ubuntu MATE Stacked Logo Margins](/images/get-involved/logo-guidelines/Ubuntu-MATE-Tag-Green-and-Black-Square-margins.png)
ru: {:.center .small} ![Столбчатый логотип Ubuntu MATE](/images/get-involved/logo-guidelines/Wheel_tag_coloured.png) ![Столбчатый логотип Ubuntu MATE, границы](/images/get-involved/logo-guidelines/Ubuntu-MATE-Tag-Green-and-Black-Square-margins.png)

source: A stacked version of the logo has also been made. Consistent use of the Ubuntu MATE logo is essential in creating a united brand identity. The master logo is supplied as artwork and should never be altered, distorted or re-created in any way.
ru: Версия логотипа в виде столбика также было создана. Правильное использование логотипа Ubuntu MATE необходимо для создания единого фирменного стиля. Главный логотип предоставляется в виде иллюстраций, и его нельзя каким-либо образом изменять, искажать или воссоздавать.

source: The stacked Ubuntu MATE logo must always have a clear area surrounding it, free from any other element. To define this area, measure the height of the roundel and use a quarter of this measure to create the boundary of clear space around the logo.
ru: Столбчатый логотип Ubuntu MATE всегда должен иметь чистую область вокруг него, свободную от каких-либо других элементов. Чтобы определить эту область, измерьте высоту кружка и используйте четверть этой меры, чтобы создать границу свободного пространства вокруг логотипа.

source: ### Assets
ru: ### Файлы

source: You can find these graphic assets in the [ubuntu-mate/brand-artwork](https://github.com/ubuntu-mate/brand-artwork) repository.
ru: Вы можете найти графические файлы в репозитории [ubuntu-mate/brand-artwork](https://github.com/ubuntu-mate/brand-artwork).
