Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-bug-fixing.po
Languages: ru

source: title: Bug Fixing
ru: title: Исправление ошибок

source: ## Bug Fixing
ru: ## Исправление ошибок

source: If you're new to fixing bugs in Ubuntu MATE, and Ubuntu in general, you'll need a [Launchpad](https://bugs.launchpad.net/+login) account. This [Ubuntu Wiki page](https://wiki.ubuntu.com/HelpingWithBugs) is an excellent place to get started.
ru: Если вы новичок в исправлении ошибок в Ubuntu MATE и Ubuntu в целом, то вам понадобится учетная запись [Launchpad](https://bugs.launchpad.net/+login). Эта [страница Ubuntu Wiki](https://wiki.ubuntu.com/HelpingWithBugs) - отличное место для начала.

source: ### Recommended Skills
ru: ### Рекомендуемые навыки

source: Although programming knowledge is very helpful in fixing bugs, there are some non-programming ways to handle reported and triaged issues. For example, there might be a typo or a problem with documentation. If you're proficient in a non-English language, you might fix a translation error. If you have Internet detective skills, you can track down fixes from upstream developers or other distributions.
ru: Хотя знания программирования очень полезны при исправлении ошибок, так же существуют не связанные с программированием способы взаимодействия с сообщениями об ошибках и их сортировкой. Например, может быть опечатка или проблема с документацией. Если вы владеете языком, отличным от английского, то вы сможете исправить ошибку перевода. А если у вас есть навыки интернет-детектива, то вы сможете найти исправления в восходящем потоке (upstream) или в других дистрибутивах.

source: ### Where to Start
ru: ### Где начать

source: The [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate) lists all open bugs. The bug tracker displays a bug's status (e.g. `New`, `Triaged`) and its importance (`Undecided`, `Wishlist`, `Low`, `High`). If a bug is `New`, it's best to [triage the bug](/get-involved/bug-triage/), to at least be sure it's a confirmed bug.
ru: Трекер [ошибок Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate) отображает все открытые сообщения об ошибках. Трекер ошибок отображает состояние каждой ошибки, т.е. `New` (`Новая`), `Triaged` (`Отсортированная`) и ее важность, т.е. `Undecided` (`Неопределенная`), `Wishlist` (`Пожелание`), `Low` (`Низкая`), `High` (`Высокая`). Если ошибка `New` (`Новая`), то наилучшим вариантом [будет ее сортировка](/get-involved/bug-triage/), чтобы быть уверенными, что она хотя бы подтверждается.

source: If you would like to start in a safe, bug-fixing sandbox, you can practice with the trivial bugs of the [One Hundred Papercuts](https://launchpad.net/hundredpapercuts) project.
ru: Если вы хотите начать в безопасной песочнице для исправления ошибок, то вы можете попрактиковаться с тривиальными ошибками проекта [One Hundred Papercuts](https://launchpad.net/hundredpapercuts).

source: ### Learn More
ru: ### Узнать больше

source: This [Ubuntu Wiki](https://wiki.ubuntu.com/Bugs/HowToFix) page walks users through fixing bugs in Ubuntu. Also, be sure to use the amazing resource that is the [Ubuntu MATE community](https://ubuntu-mate.community/c/support/10)! Lastly, this video, in addition to being a useful resource on Bug Triaging, also explains why it's important to make the fix in the right place, and why patching at the Ubuntu level (in the packages) is sometimes a better decision than only fixing upstream.
ru: Эта страница [Ubuntu Wiki](https://wiki.ubuntu.com/Bugs/HowToFix) проводит пользователя через весь процесс исправления ошибок в Ubuntu. Также обязательно воспользуйтесь таким замечательным ресурсом, как [сообщество Ubuntu MATE](https://ubuntu-mate.community/c/support/10)! Наконец, это видео, помимо того, что является полезным пособием по выявлению и сортировке ошибок, также объясняет почему нужно делать исправление в нужном месте и почему исправление на уровне Ubuntu (в пакетах) иногда оказывается лучшим решением, чем простое исправление в восходящем потоке.
