Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-testing-qa.po
Languages: ru

source: title: Testing & Quality Assurance
ru: title: Тестирование и обеспечение качества

source: ## Testing & Quality Assurance
ru: ## Тестирование и обеспечение качества

source: Ubuntu MATE is always improving and changing. Our development team is constantly working to make this the best experience possible but there will always be **bugs**! Finding these makes life easier on the developers and makes things better for our users. -- **including you** :wink:
ru: Ubuntu MATE постоянно улучшается и меняется. Наша команда разработчиков постоянно работает над тем, чтобы сделать эти процессы максимально комфортными, но здесь всегда могут возникнуть **ошибки**! Их поиск облегчает жизнь разработчикам и улучшает жизнь всех наших пользователей. -- **включая вас** :wink:

source: **So you want to find :bug:'s and join in the fun? Yes, it really is!** :slightly_smiling_face:
ru: **Хотите ли вы поискать :bug: и присоединиться к веселью? Да, действительно так!** :slightly_smiling_face:

source: * Join the [Ubuntu MATE Community](https://ubuntu-mate.community/)
ru: * Присоединитесь к [сообществу Ubuntu MATE](https://ubuntu-mate.community/)

source: * Create a [Launchpad/Ubuntu SSO](https://login.launchpad.net/qGtZ05jM0QUUftoV/+login) account
ru: * Создайте единую учетную запись [Launchpad/Ubuntu SSO](https://login.launchpad.net/qGtZ05jM0QUUftoV/+login)

source: * [Download the ISO](http://iso.qa.ubuntu.com/qatracker)
ru: * [Скачайте файл ISO-образа](http://iso.qa.ubuntu.com/qatracker)

source: ![Showing download links on the Ubuntu ISO tracker](/images/get-involved/qa/download.png)
ru: ![Отображение ссылок для загрузки на ISO трекере Ubuntu](/images/get-involved/qa/download.png)

source: * Test!
ru: * Тестируйте!

source: ![Showing test cases on the Ubuntu ISO tracker](/images/get-involved/qa/testcases.png)
ru: ![Отображение способов тестирования на ISO трекере Ubuntu](/images/get-involved/qa/testcases.png)

source: * Report and Update the ISO Tracker
ru: * Сообщите о результатах и обновите ISO трекер

source: ![Showing reports on the Ubuntu ISO tracker](/images/get-involved/qa/report.png)
ru: ![Отображение результатов на ISO трекере Ubuntu](/images/get-involved/qa/report.png)

source: It's pretty simple but very important! Here are some tips & tricks that will help.
ru: Это довольно просто, но очень важно! Вот несколько советов и приемов, которые помогут.

source: * [How to report bugs](https://ubuntu-mate.community/t/how-to-report-problems-in-ubuntu-mate/17943) * [Step-by-step guide](https://wiki.ubuntu.com/Testing/ISO/Walkthrough) * Let us know about issues via the [Ubuntu MATE Community](https://ubuntu-mate.community/)
ru: * [Как сообщить об ошибках](https://ubuntu-mate.community/t/how-to-report-problems-in-ubuntu-mate/17943) * [Пошаговая инструкция](https://wiki.ubuntu.com/Testing/ISO/Walkthrough) * Сообщите нам о проблемах через [сообщество Ubuntu MATE](https://ubuntu-mate.community/)

source: Also remember to ask yourself **Is the problem reproducible?** We need to know the steps needed to reproduce your issue.
ru: Также не забудьте спросить себя: **Воспроизводима ли эта проблема?** Нам нужно знать шаги для воспроизведения вашей проблемы.

source: While you can certainly download an ISO release individually. For convenience, we **highly recommend** *zsync*. Eric Adams has produced a short video that is a great introduction to using *zsync* for testing:
ru: Вы конечно же можете скачивать ISO релиз каждый раз заново, но для удобства мы **настоятельно рекомендуем** использовать *zsync*. Эрик Адамс выпустил короткое видео, которое является отличным введением в использование *zsync* при тестировании:

source: We'd :green_heart: to have you join us in testing and become part of our **Community**. We are always looking for more testers!
ru: Мы будем :green_heart: чтобы вы присоединились к нам в тестировании и стали частью нашего **Сообщества**. Мы всегда ищем больше новых тестировщиков!

source: Finally, [Alan Pope](https://popey.com/) has produced a wonderful [video](https://www.youtube.com/watch?v=hXLiqjOkSmg) on testing Ubuntu MATE. We are sure you can do a better job of it than he did. :rofl:
ru: Наконец, [Алан Поуп](https://popey.com/) выпустил замечательное [видео](https://www.youtube.com/watch?v=hXLiqjOkSmg) о тестировании Ubuntu MATE. Мы уверены, что вы справитесь с этим даже лучше, чем он. :rofl:
