Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-community-support.po
Languages: ru

source: title: Community Support
ru: title: Поддержка сообщества

source: ## Community Support
ru: ## Поддержка сообщества

source: If you are good with Ubuntu MATE and also good with people, then an unsung but vital form of contribution is helping your fellow users over at our **[Community](https://ubuntu-mate.community/)**. Here's some of the key ways you can help grow the community.
ru: Если вы разбираетесь в Ubuntu MATE и любите общаться, тогда незаметной, но очень важной формой взаимодействия является помощь вашим коллегам в нашем **[сообществе](https://ubuntu-mate.community/)**. Вот несколько ключевых способов, которыми вы можете помочь развитию сообщества.

source: ### Help and Support Forum
ru: ### Помощь и поддержка на форуме

source: Many Ubuntu MATE users, especially those who are new (and possibly new to Linux!) post in our [Support and Help Requests](https://ubuntu-mate.community/c/10) category. Helping others shares your knowledge with a wide audience, helps your fellow users achieve their goals, and helps the project reach more people. If you see a post where your experience and guidance could make a difference, be like Captain Picard and engage!
ru: Многие пользователи Ubuntu MATE, особенно новички (и, возможно, плохо знакомые с Linux!), размещают сообщения в нашей категории [Support and Help Requests](https://ubuntu-mate.community/c/10). Помогая другим, вы делитесь своими знаниями с широкой аудиторией, помогаете другим пользователям достичь своих целей и помогаете проекту охватить больше людей. Если вы видите сообщение, в котором ваш опыт и рекомендации могут иметь значение, будьте как капитан Пикард и действуйте!

source: ### Development Discussion
ru: ### Обсуждение разработки

source: Even though [Development Discussion](https://ubuntu-mate.community/c/15) doesn't get as much lurve as Help and Support, it's still another forum that benefits from new viewpoints and voices. For example, one of our Hebrew-language users helped bring our attention to an issue where [Welcome struggled with right-to-left languages](https://ubuntu-mate.community/t/19585/8). This helped our developers fix the immediate issue, and to keep this in mind for future versions. So if you have an idea (that's not a bug report) on how to improve Ubuntu MATE, let us know in the Development Discussion!
ru: Несмотря на то, что [Development Discussion](https://ubuntu-mate.community/c/15) не так привлекательно, как справка и поддержка, это еще один форум, который выигрывает от новых точек зрения и голосов. Например, один из наших пользователей, говорящий на иврите, помог привлечь наше внимание к проблеме, связанной с [языками с письмом справа налево в приложении Welcome](https://ubuntu-mate.community/t/19585/8). Это помогло нашим разработчикам решить сиюминутную проблему и иметь это в виду для будущих версий. Так что если у вас есть идея (но не отчет об ошибке) по улучшению Ubuntu MATE, дайте нам знать в Development Discussion!

source: ### Tips, Tricks and Tutorials
ru: ### Советы, приемы и руководства

source: If you think of something that would be genuinely useful to others, consider writing out a guide, note it out as a quick tip, or write a tutorial. All posts in these categories are wiki, so you are welcome to improve upon others' work too.
ru: Если вы думаете о чем-то, что было бы действительно полезно для других, подумайте о том, чтобы написать руководство, запишите его как быстрый совет или напишите учебное пособие. Все сообщения в этих категориях - это вики, так что вы также можете улучшать работу других.

source: ### Be the Welcoming Committee
ru: ### Будьте вежливы и приветливы

source: Patience is a virtue. And like most virtues, sometimes it isn't easy. Interacting online has its own challenges, and it can be a little too easy to dismiss people. But you could be the difference between someone who abandons Ubuntu MATE because of a lack of friendly support, and someone who becomes an invested member of the community. So be brilliant, be helpful, and as Bill and Ted say, be excellent to each other.
ru: Терпение - это добродетель. И, как и большинство добродетелей, иногда это непросто. У онлайн-взаимодействия есть свои проблемы, и терять людей может быть слишком легко. Но нужно понимать разницу между случаями, когда кто-то отказывается от Ubuntu MATE из-за отсутствия дружеской поддержки, и когда кто-то становится активным членом сообщества. Так что будьте дружелюбны, помогайте и, как говорят Билл и Тед, превосходно относитесь друг к другу.
