Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/get-involved-artwork.po
Languages: ru

source: title: Artwork
ru: title: Внешний вид

source: ## Artwork
ru: ## Внешний вид

source: We might be biased, or REALLY like the color green, but we think Ubuntu MATE is pretty sharp looking. If you're graphically inclined, or you love testing themes, then we have several different ways to contribute.
ru: Мы можем быть предвзятыми или ДЕЙСТВИТЕЛЬНО любим зеленый цвет, но мы думаем, что Ubuntu MATE выглядит довольно круто. Если вы склонны к графике или любите тестировать темы, вы можете внести свой вклад несколькими способами.

source: ## Wallpaper
ru: ## Фон рабочего стола

source: If you have digital art or photography you think would make a brilliant Ubuntu MATE wallpaper, we invite you to [share it with the rest of the community](https://ubuntu-mate.community/c/multimedia/artwork/8). To be considered for official inclusion in Ubuntu MATE, wallpaper must:
ru: Если у вас есть цифровой рисунок или фотография, которые, по вашему мнению, могут стать великолепным фоном для Ubuntu MATE, то мы приглашаем вас [поделиться ими с остальным сообществом](https://ubuntu-mate.community/c/multimedia/artwork/8). Учтите, что для официального включения фона в Ubuntu MATE, он должен:

source: * have a minimum resolution of 1920x1080. * be posted under the [Attribution-ShareAlike 4.0 International (CC-BY-SA-4.0) license](https://creativecommons.org/licenses/by-sa/4.0/) which must be stated in the post.
ru: * иметь минимальное разрешение 1920x1080. * быть опубликован под лицензией [Attribution-ShareAlike 4.0 International (CC-BY-SA-4.0) license](https://creativecommons.org/licenses/by-sa/4.0/), что должно быть четко указано в сообщении.

source: ## Theme Testing and Fixing
ru: ## Тестирование и исправление тем

source: One of the best things about Ubuntu MATE, and all Linux distros, is the ability to customise your experience. Ubuntu MATE comes with the Ambiant-MATE theme as default, though users can choose from pre-installed themes or install their own.
ru: Одной из лучших возможностей Ubuntu MATE и всех других дистрибутивов Linux является возможность гибкой настройки внешнего вида. Ubuntu MATE поставляется с темой Ambiant-MATE по умолчанию, но пользователи могут выбирать из предустановленных тем или устанавливать свои собственные.

source: While most [GTK 2.x and GTK 3.x themes](https://mate-desktop.org/themes/) will work with MATE, some require additional support to run smoothly. If you want to contribute in this area, ask the theme maintainers to add MATE support or submit improvements yourself.
ru: Большинство [тем GTK 2.x и GTK 3.x](https://mate-desktop.org/themes/) могут быть использованы в MATE, но для некоторых требуется дополнительная доработка. Если вы хотите помочь с этим, то вы можете попросить разработчиков тем о добавлении поддержки MATE или сделать такие изменения самостоятельно.

source: If you've found a papercut in one of the pre-installed themes, raise an issue or submit a pull request:
ru: Если вы нашли неточность в одной из предустановленных тем, то создайте сообщении об ошибке или сформируйте запрос на слияние:

source: ## Develop Brand Artwork
ru: ## Разработка фирменного внешнего вида

source: Do you like swag? We do too! If you'd like to make brand artwork, we'd love to see it. Before you start creating, keep these two things in mind:
ru: Вам нравятся сувениры? Нам тоже! Если вы хотите создать брендированные вещи, то мы будем рады их увидеть. Прежде чем начать творить, помните об этих двух вещах:

source: * All brand artwork needs to be made available under the Attribution-ShareAlike 4.0 International (CC-BY-SA-4.0) license. * For usage of the Ubuntu MATE logo, please see the [Logo Guidelines](/get-involved/design-guidelines/).
ru: * Все вещи с фирменных внешним видом должны быть опубликованы под лицензией Attribution-ShareAlike 4.0 International (CC-BY-SA-4.0). * При использовании логотипа Ubuntu MATE, пожалуйста следуйте [рекомендациям](/get-involved/design-guidelines/).

source: [Brand Artwork Resources](https://github.com/ubuntu-mate/brand-artwork){:.btn}
ru: [Ресурсы по брендированию](https://github.com/ubuntu-mate/brand-artwork){:.btn}
