Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/history.po
Languages: ru

source: title: History
ru: title: История

source: ## Pre-2014 ### The Ubuntu MATE backstory
ru: ## до 2014 ### Предыстория Ubuntu MATE

source: {:.milestone-image} ![MATE is a fork of GNOME 2](/images/history/gnome-mate-fork.svg)
ru: {:.milestone-image} ![MATE как ответвление от GNOME 2](/images/history/gnome-mate-fork.svg)

source: Although Ubuntu MATE technically began with Martin Wimpress and Alan Pope's sitting around the latter's kitchen table, it first started years earlier, with Martin's quest to restore 'wedded bliss' to his home and his wife's desktop environment.
ru: Хотя технически Ubuntu MATE начинался с того, что Мартин Вимпресс и Алан Поуп сидели за кухонным столом последнего, на самом деле он начался несколькими годами раньше когда Мартин пытался восстановить "блаженство брака" в своем доме и на рабочем столе компьютера его жены.

source: At that time, Martin was an Arch developer (disclaimer: we were required to say that), and he and his wife were mostly happy using an "embryonic" GNOME 3. A few years after the birth of their first child, Martin's wife came back to a more fully fledged GNOME 3, and gave her husband a directive: make GNOME 2 come back.
ru: В то время Мартин был разработчиком дистрибутива Arch (отказ от ответственности: мы должны были это сказать), и он и его жена были в основном счастливы, используя "эмбриональный" GNOME 3. Через несколько лет после рождения их первого ребенка, жена Мартина вернулась к более полноценному GNOME 3 и сформулировала своему мужу установку: вернуть GNOME 2.

source: Martin knew the MATE Desktop, a continuation of GNOME 2, existed, but had never actually used it before. He installed MATE on the household computers and all was again well, but he noticed a few issues beneath the surface. Knowing a happy wife equaled a happy life, Martin did what any Linux-using husband would do: he began contributing to the MATE Desktop. At first, this was low-key, mostly packaging for Arch, but then he began to make patches and fixes upstream. He also began installing the MATE Desktop for family members who weren't as technically proficient, who mainly wanted ease of use and continuity.
ru: Мартин знал о существовании MATE Desktop, продолжения GNOME 2, но никогда раньше его не использовал. Он установил MATE на домашние компьютеры, и все снова стало хорошо, но он заметил несколько скрытых проблем. Зная, что счастливая жена - это счастливая жизнь, Мартин сделал то, что сделал бы любой муж, использующий Linux: он начал работать над MATE Desktop. Сначала это было скромно, в основном это было создание пакетов для Arch, но затем он начал делать патчи и исправления в апстриме. Он также начал установку MATE Desktop для членов семьи, не обладающих техническими навыками, которые в основном хотели простоты использования и непрерывности.

source: As Martin became more involved with the MATE Desktop, he also became more involved in the world of Linux podcasting. He became an occasional talking head on [Linux Unplugged](https://linuxunplugged.com/), which nicely dovetailed with his new role as a community manager for the MATE Desktop. This meant he started doing more interviews, one of which was on the [Ubuntu Podcast](https://ubuntupodcast.org/) in 2012 or 2013. During the interview Martin pointed out how MATE was rather broken in Ubuntu, which saddened Alan Pope, one of the shows' hosts, for anyone unfamiliar with the podcast. He's still there, along with Mark Johnson and...gasp!...Martin.
ru: По мере того, как Мартин все больше увлекался MATE Desktop, он также все больше участвовал в мире подкастинга Linux. Время от времени он выступал в роли «говорящей головы» в [Linux Unplugged](https://linuxunplugged.com/), что хорошо соответствовало его новой роли менеджера сообщества для MATE Desktop. Это означало, что он начал давать больше интервью, одно из которых было на [Ubuntu Podcast](https://ubuntupodcast.org/) в 2012 или 2013 годах. Во время интервью Мартин указал на то, что MATE был достаточно сильно сломан в Ubuntu, что опечалило Алана Поупа, одного из ведущих шоу (примечание для всех, кто не знаком с подкастом). Он все еще здесь, вместе с Марком Джонсоном и ... ах! ... Мартином.

source: ## 2014 ### Popey and Wimpress
ru: ## 2014 ### Поуп и Вимпресс

source: {:.milestone-image} ![Selfie photo of Wimpress and Popey](/images/people/wimpress-and-popey.webp)
ru: {:.milestone-image} ![Селфи-фото Вимпресса и Поупа](/images/people/wimpress-and-popey.webp)

source: A few weeks later, Martin got an e-mail from Alan with a one-word subject line: "Hah!" In the e-mail, Alan gave a link to matey.iso, the forebearer of Ubuntu MATE. By this point, Martin's family were growing frustrated with their desktop experience, and Martin found himself spending breaks managing their frustrations. They had stopped using the laptops Martin had provided, which were running the MATE Desktop on Arch (tricky to maintain from afar), and there were even rumors of switching to MacBooks. Quelle horreur!
ru: Несколько недель спустя Мартин получил письмо от Алана с одним словом в теме письма: "Ха!" В письме Алан дал ссылку на matey.iso, предшественника Ubuntu MATE. К этому моменту семья Мартина все больше разочаровывалась в опыте использования компьютеров, и Мартин обнаружил, что проводит перерывы в попытках решения их проблем. Они перестали использовать предоставленные Мартином ноутбуки, на которых был запущен рабочий стол MATE на Arch (его сложно поддерживать издалека), и даже ходили слухи о переходе на MacBook. Quelle horreur!

source: Alan's e-mail, therefore, couldn't have come at a better time. Martin knew Ubuntu's reliability would make "a sensible way forward." Alan and Martin took a day off work, and Martin made the brief drive to Alan's house. They sat in Alan's kitchen and put together the very first version of Ubuntu MATE. Once they were done, as Martin recalls, Alan "kind of looked at me square in the eye and said 'you're responsible for this now. I'm out.'"
ru: Поэтому электронное письмо Алана пришло как раз вовремя. Мартин знал, что надежность Ubuntu поможет сделать заметный шаг вперед. Алан и Мартин взяли выходной и приехали домой к Алану. Они сидели на кухне Алана и собрали самую первую версию Ubuntu MATE. Как только они закончили, вспоминает Мартин, Алан посмотрел на него и сказал "теперь ты за это отвечаешь, а я ухожу".

source: ## 15.04 ### Ubuntu MATE becomes an official flavour
ru: ## 15.04 ### Ubuntu MATE становится официальной редакцией

source: {:.milestone-image} ![Ubuntu MATE joins the Ubuntu family](/images/history/join-family.svg)
ru: {:.milestone-image} ![Ubuntu MATE становится частью семьи Ubuntu](/images/history/join-family.svg)

source: Ubuntu MATE 14.10 was the [inaugural release](https://ubuntu-mate.org/blog/ubuntu-mate-utopic-final-release/), and it didn't take long for wider adoption to follow. With the release of 15.04, Ubuntu MATE was now an [official Ubuntu community flavour](https://www.omgubuntu.co.uk/2015/02/ubuntu-mate-is-now-an-official-ubuntu-flavor). In 2015, [Entroware](https://www.entroware.com) announced it would offer Ubuntu MATE as a pre-install choice to its customers - the first example of an OEM supporting a boutique independent distribution. Incidentally, this made Martin's job as family IT support much easier, as he could simply point curious relatives to buy a laptop with the operating system he "basically designed for them pre-installed."
ru: Ubuntu MATE 14.10 был [первым выпуском](https://ubuntu-mate.org/blog/ubuntu-mate-utopic-final-release/), и вскоре последовало его широкое распространение. С выпуском 15.04 Ubuntu MATE стал [официальной редакцией сообщества Ubuntu](https://www.omgubuntu.co.uk/2015/02/ubuntu-mate-is-now-an-official-ubuntu-flavor). В 2015 году [Entroware](https://www.entroware.com) объявила, что предложит своим клиентам Ubuntu MATE в качестве предустановленной системы - первый пример OEM, поддерживающего независимую дистрибуцию. Кстати, это значительно облегчило Мартину работу по ИТ-поддержке в семье, так как он мог просто указать любопытным родственникам купить ноутбук с предустановленной операционной системой, которую он "в основном разработал для них".

source: ## 15.10 ### Introducing Software Boutique
ru: ## 15.10 ### Появление магазина программного обеспечения

source: {:.milestone-image} ![Software Boutique logo - a coat hanger](/images/ubuntu-mate/boutique.svg)
ru: {:.milestone-image} ![Логотип магазина программного обеспечения - вешалка](/images/ubuntu-mate/boutique.svg)

source: The next release, however, involved a news-making controversy: the removal of the Ubuntu Software Center as a default, in favor of a highly curated Software Boutique inside the new Ubuntu MATE Welcome. This sparked headlines across the Internet, even as many users admitted the Ubuntu Software Center was buggy and slow. The replacement, however, was popular with users - VERY popular with [Chris Fisher from JB](https://youtu.be/KhzKnIMbn8g?t=510).
ru: Следующий выпуск, однако, вызывал разногласия, связанные с новостями: удаление Ubuntu Software Center по умолчанию в пользу тщательно подобранного ассортимента программ в магазине программного обеспечения (Software Boutique) внутри нового Ubuntu MATE Welcome. Это создало резонанс в Интернете, хотя многие пользователи признали, что Центр программного обеспечения Ubuntu (Ubuntu Software Center) работает медленно и с ошибками. Замена, однако, стала популярной среди пользователей - она ОЧЕНЬ популярна у [Криса Фишера из Jupiter Broadcasting](https://youtu.be/KhzKnIMbn8g?t=510).

source: ## 16.04 ### The First Official LTS
ru: ## 16.04 ### Перый официальный LTS

source: Canonical granted LTS status to Ubuntu MATE 16.04, its first offical long-term support version. Canonical also upgraded Martin to an employee on the Desktop Team in time for the 16.10 release.
ru: Canonical предоставила статус LTS для Ubuntu MATE 16.04, ее первой официальной версии с долгосрочной поддержкой. Canonical также повысила статус Мартина до уровня сотрудника Desktop Team к выпуску версии 16.10.

source: ## 16.10 ### Ending the PowerPC Era
ru: ## 16.10 ### Конец эры PowerPC

source: Prior to 2006, Power PCs were popular in Macs, before Apple switched to Intel processors. Ubuntu MATE initially provided support for these older machines, even buying a few secondhand specifically for development and testing. However, supporting this older architecture became increasingly difficult, and 16.04.01 was the last build, with Long Term Support ending in April 2019.
ru: До 2006 года процессоры Power PC были популярны на компьютерах Mac, прежде чем Apple перешла на процессоры Intel. Ubuntu MATE изначально обеспечивал поддержку этих старых машин, даже купив несколько подержанных машин специально для разработки и тестирования. Однако поддержка этой старой архитектуры становилась все труднее, и 16.04.1 была последней сборкой, долгосрочная поддержка которой закончилась в апреле 2019 года.

source: ## 18.10 ### Ending the i386 Era
ru: ## 18.10 ### Конец эры i386

source: In a post to the [Ubuntu MATE Community](https://ubuntu-mate.community/t/16715), Martin explained that Ubuntu MATE would no longer provide i386 (32-bit Intel) images, although they could continue to carry i386 packages in the repository. Although this was an unpopular decision with users still running i386 architecture, this decision was in line with several application and driver vendors, including nvidia and Mozilla, who had previously dropped their own support for the older platform.
ru: В своем сообщении в [сообществе Ubuntu MATE](https://ubuntu-mate.community/t/16715) Мартин объяснил, что Ubuntu MATE больше не будет предоставлять образы i386 (32-битный Intel), при сохранении таких i386 пакетов в репозитории. Хотя это решение было непопулярным среди пользователей, все еще использующих архитектуру i386, это решение было согласовано с рядом поставщиков приложений и драйверов, включая Nvidia и Mozilla, которые ранее отказались от собственной поддержки старой платформы.

source: ## 20.04 and beyond ### Towards a Retrospective Future
ru: ## 20.04 и далее ### Вперед к ретроспективному будущему

source: {:.milestone-image} ![Laptop running Ubuntu MATE](/images/ubuntu-mate/laptop.png)
ru: {:.milestone-image} ![Ноутбук с Ubuntu MATE](/images/ubuntu-mate/laptop.png)

source: The rest of Ubuntu MATE's history has yet to be written! The [roadmap](/faq/roadmap/) explains where the project will hopefully be in the years to come. If you want to be a part of that history to come, head over to our [Get Involved](/get-involved/) page.
ru: Остальная часть истории Ubuntu MATE еще не написана! В [дорожной карте](/faq/roadmap/) объясняется, где, как мы надеемся, будет развиваться проект в ближайшие годы. Если вы хотите стать частью этой истории в будущем, перейдите на нашу страницу [Принять участие](/get-involved/).

source: *Many thanks to InfinitelyGalactic for his interview with Martin, which provided much of the backstory and can be viewed [here](https://www.youtube.com/watch?v=-ls8xHhY4fI&t=1528s).*
ru: *Большое спасибо InfinitelyGalactic за его интервью с Мартином, которое предоставило большую часть предыстории и его можно просмотреть [здесь](https://www.youtube.com/watch?v=-ls8xHhY4fI&t=1528s).*
