Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/requirements.po
Languages: ru

source: title: System Requirements
ru: title: Системные требования

source: Ubuntu MATE has modest hardware requirements, making it is suitable for modern workstations, single board computers and older hardware alike. Ubuntu MATE makes modern computers fast and old computers usable.
ru: Ubuntu MATE имеет скромные аппаратные требования, что делает его подходящим для современных рабочих станций, одноплатных компьютеров и более старого оборудования. Ubuntu MATE делает современные компьютеры быстрыми, а старые - удобными.

source: ### Desktop and Laptop Computers
ru: ### Компьютеры и ноутбуки

source: | | Minimum | Recommended | | ----------------- | ----------------- | ------------------------- | | **CPU** | Pentium M 1.0GHz | Core 2 Duo 1.6GHz | **CPU Architecture** | [i386] (until 2021) | [amd64] | **RAM** | 1 GB | 4 GB | **Storage** | 8 GB | 16 GB | **Boot Media** | Bootable DVD-ROM | Bootable DVD-ROM or USB Flash Drive | **Display** | 1024 x 768 | 1440 x 900 or higher (with graphics acceleration)
ru: | | Минимально | Рекомендуется | | ----------------- | ----------------- | ------------------------- | | **CPU** | Pentium M 1.0ГГц | Core 2 Duo 1.6ГГц | **Архитектура CPU** | [i386] (до 2021) | [amd64] | **RAM** | 1 Гб | 4 Гб | **Хранилище** | 8 Гб | 16 Гб | **Загрузочный носитель** | загрузочный DVD-ROM | загрузочный DVD-ROM или USB Flash Drive | **Дисплей** | 1024 x 768 | 1440 x 900 или выше (с графическим ускорением)

source: Only the **B models** of the Raspberry Pi family are supported:
ru: Поддерживаются только **модели B** семейства Raspberry Pi:

source: * Raspberry Pi 2 * Raspberry Pi 3 * Raspberry Pi 3+ * Raspberry Pi 4 (all memory sizes)
ru: * Raspberry Pi 2 * Raspberry Pi 3 * Raspberry Pi 3+ * Raspberry Pi 4 (все объемы памяти)

source: All models support the [armhf] architecture. The Raspberry Pi 3 and newer can also take advantage of the 64-bit CPU using the [arm64] release.
ru: Все модели поддерживают архитектуру [armhf]. Raspberry Pi 3 и более новые могут воспользоваться преимуществами использования 64-битной архитектуры процессора, используя выпуски для [arm64].

source: The micro-SD card needs to be a minimum of 5 GB.
ru: Карта памяти micro-SD должна быть не менее 5 Гб.

source: ### Hardware Ports
ru: ### Аппаратное портирование

source: Ubuntu MATE has been officially ported to, and works great on:
ru: Ubuntu MATE была официально портирована и отлично работает на:

source: | Codename | Compatible with | | --------------------- | ------------------------------------------------- | | [gpd_pocket](/download/gpd_pocket/) | Original GPD Pocket. | [gpd_pocket_2](/download/gpd_pocket_2/)| GPD Pocket 2, GPD Win 2, OneMix Yoga 1s and OneMix Yoga 2. | [gpd_micropc](/download/gpd_micropc/) | GPD MicroPC | [gpd_p2_max](/download/gpd_p2_max/) | Topjoy Falcon
ru: | Кодовое имя | Совместимость с | | --------------------- | ------------------------------------------------- | | [gpd_pocket](/download/gpd_pocket/) | Оригинальный GPD Pocket. | [gpd_pocket_2](/download/gpd_pocket_2/)| GPD Pocket 2, GPD Win 2, OneMix Yoga 1s и OneMix Yoga 2. | [gpd_micropc](/download/gpd_micropc/) | GPD MicroPC | [gpd_p2_max](/download/gpd_p2_max/) | Topjoy Falcon
