Repository: 1510janu/ubuntu-mate.org
Catalog: _i18n/*/shop-computers.po
Languages: ru

source: title: Desktops & Laptops
ru: title: Компьютеры & Ноутбуки

source: - group: Laptops items:
ru: - group: Ноутбуки items:

source: - name: 14" Apollo price: Starting at £739.99 img: /images/shop/entroware/apollo_front_mate.png url: https://www.entroware.com/store/apollo?tracking=ubmate description: >-
ru: - name: 14" Apollo price: от £739.99 img: /images/shop/entroware/apollo_front_mate.png url: https://www.entroware.com/store/apollo?tracking=ubmate description: >-

source: Configurable with 10th Generation Intel® Core™ Processors, up to 64GB DDR4 2666 MHz, up to 6TB storage, 14” Matte FHD LED (1920x1080), Intel® UHD Graphics.
ru: Выбор из 10-го поколения Intel® Core™ Processors, до 64Гб DDR4 2666 МГц, до 6Тб хранилища, 14” матовой FHD LED (1920x1080), Intel® UHD Graphics.

source: - name: 17" Hybris price: Starting at £799.99 img: /images/shop/entroware/hybris_front_mate.png url: https://www.entroware.com/store/hybris?tracking=ubmate description: >-
ru: - name: 17" Hybris price: от £799.99 img: /images/shop/entroware/hybris_front_mate.png url: https://www.entroware.com/store/hybris?tracking=ubmate description: >-

source: Configurable with 9th Generation Intel® Core™ Processors, up to 64GB DDR4 2666 MHz, up to 6TB storage, 17.3” Matte FHD LED (1920x1080), Intel® UHD Graphics, optional NVIDIA® Graphics.
ru: Выбор из 9-го поколения Intel® Core™ Processors, до 64Гб DDR4 2666 МГц, до 6Тб хранилища, 17.3” матовый FHD LED (1920x1080), Intel® UHD Graphics, опционально NVIDIA® Graphics.

source: - name: 15" Proteus price: Starting at £769.99 img: /images/shop/entroware/proteus_front_mate.png url: https://www.entroware.com/store/proteus?tracking=ubmate description: >-
ru: - name: 15" Proteus price: от £769.99 img: /images/shop/entroware/proteus_front_mate.png url: https://www.entroware.com/store/proteus?tracking=ubmate description: >-

source: Configurable with 10th Generation Intel® Core™ Processors, up to 64GB DDR4 2666 MHz, up to 2TB storage, 15.6” Matte FHD LED (1920x1080), Intel® UHD Graphics.
ru: Выбор из 10-го поколения Intel® Core™ Processors, до 64Гб DDR4 2666 МГц, до 2Тб хранилища, 15.6” матовый FHD LED (1920x1080), Intel® UHD Graphics.

source: - group: Desktops items: - name: 24" Ares price: Starting at £689.99 img: /images/shop/entroware/ares.png url: https://www.entroware.com/store/ares?tracking=ubmate description: >-
ru: - group: Компьютеры items: - name: 24" Ares price: от £689.99 img: /images/shop/entroware/ares.png url: https://www.entroware.com/store/ares?tracking=ubmate description: >-

source: Configurable with 9th Generation Intel® Core™ Processors, up to 32GB DDR4 2666 MHz, up to 6TB storage, 24” Matte FHD LED (1920x1080), Intel® HD Graphics.
ru: Выбор из 9-го поколения Intel® Core™ Processors, до 32Гб DDR4 2666 МГц, до 6Тб хранилища, 24” матовый FHD LED (1920x1080), Intel® HD Graphics.

source: - name: Aura price: Starting at £499.99 img: /images/shop/entroware/aura.png url: https://www.entroware.com/store/aura?tracking=ubmate description: >-
ru: - name: Aura price: от £499.99 img: /images/shop/entroware/aura.png url: https://www.entroware.com/store/aura?tracking=ubmate description: >-

source: Configurable with 9th Generation Intel® Core™ Processors, up to 32GB DDR4 2666 MHz, up to 6TB storage, optional 24" or 27" Matte FHD LED (1920x1080) displays, Intel® Iris® Plus Graphics 655.
ru: Выбор из 9-го поколения Intel® Core™ Processors, до 32Гб DDR4 2666 МГц, до 6Тб хранилища, опционально 24" или 27" матовый FHD LED (1920x1080) дисплей, Intel® Iris® Plus Graphics 655.

source: - name: Hades price: Starting at £1899.99 img: /images/shop/entroware/hades.png url: https://www.entroware.com/store/hades?tracking=ubmate description: >-
ru: - name: Hades price: от £1899.99 img: /images/shop/entroware/hades.png url: https://www.entroware.com/store/hades?tracking=ubmate description: >-

source: Configurable with 2nd Generation AMD® Ryzen™ Threadripper™ Processors, up to 128GB DDR4 2933 MHz pr 128GB DDR4 2400 Mhz ECC, up to 68TB storage, optional 24" or 27" Matte FHD LED (1920x1080) displays, NVIDIA® GT1030 and NVIDIA® RTX 2060/2070/2080/2080Ti Graphics.
ru: Выбор из 2-го поколения AMD® Ryzen™ Threadripper™ Processors, до 128Гб DDR4 2933 МГц или 128Гб DDR4 2400 МГц ECC, до 68Тб хранилища, опционально 24" или 27" матовый FHD LED (1920x1080) дисплей, NVIDIA® GT1030 и NVIDIA® RTX 2060/2070/2080/2080Ti Graphics.

source: {:.center} [![Entroware logo](/images/shop/entroware/entroware.png)](https://www.entroware.com/store/?tracking=ubmate)
ru: {:.center} [![Entroware логотип](/images/shop/entroware/entroware.png)](https://www.entroware.com/store/?tracking=ubmate)

source: [Entroware](https://entroware.com/) is a UK based Linux computer manufacturer, founded in early 2014, providing a range of quality Linux computers focused on a complete “out of the box” Linux experience, with a heavy focus on hardware compatibility. Entroware are offering the option to purchase their entire range of computers with Ubuntu MATE pre-installed including full support.
ru: [Entroware](https://entroware.com/) британский производитель компьютеров с Linux, основанный в раннем 2014 году, предоставляет широкий диапазон качественных Linux-компьютеров, сосредоточен на предоставлении качественного Linux опыта "из-коробки" благодаря высокой аппаратной совместимости. Entroware предоставляет возможность приобретения компьютеров с предустановленным Ubuntu MATE с полной поддержкой.
